
main.elf:     file format elf32-littlearm

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         00001d60  08000000  08000000  00010000  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  1 .rodata       00000038  08001d60  08001d60  00011d60  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  2 .data         00000008  20000000  08001d98  00020000  2**3
                  CONTENTS, ALLOC, LOAD, DATA
  3 .bss          000002e0  20000008  08001da0  00020008  2**2
                  ALLOC
  4 ._usrstack    000003e8  200002e8  08001da0  000202e8  2**0
                  ALLOC
  5 .comment      0000001e  00000000  00000000  00020008  2**0
                  CONTENTS, READONLY
  6 .debug_aranges 000003b0  00000000  00000000  00020026  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  7 .debug_info   00002ddf  00000000  00000000  000203d6  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  8 .debug_abbrev 000008d9  00000000  00000000  000231b5  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  9 .debug_line   0000361f  00000000  00000000  00023a8e  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
 10 .debug_frame  00000bdc  00000000  00000000  000270b0  2**2
                  CONTENTS, READONLY, DEBUGGING, OCTETS
 11 .debug_str    0005168f  00000000  00000000  00027c8c  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS

Contents of the .debug_info section (loaded from main.elf):

  Compilation Unit @ offset 0x0:
   Length:        0x9e3 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc71a): GNU C99 10.2.0 -mcpu=cortex-m3 -mthumb -mfloat-abi=soft -march=armv7-m -g3 -O0 -std=c99 -fdata-sections -ffunction-sections -fno-exceptions
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x44446): main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x4413b): /home/leha/work/Electronics/HPS_growbox/BrygðiOS/Brig-iOS
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x2c338): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 1
    <39>   DW_AT_encoding    : 6	(signed char)
    <3a>   DW_AT_name        : (indirect string, offset: 0x3cfec): signed char
 <1><3e>: Abbrev Number: 4 (DW_TAG_typedef)
    <3f>   DW_AT_name        : (indirect string, offset: 0x486c): __uint8_t
    <43>   DW_AT_decl_file   : 2
    <44>   DW_AT_decl_line   : 43
    <45>   DW_AT_decl_column : 24
    <46>   DW_AT_type        : <0x4a>
 <1><4a>: Abbrev Number: 3 (DW_TAG_base_type)
    <4b>   DW_AT_byte_size   : 1
    <4c>   DW_AT_encoding    : 8	(unsigned char)
    <4d>   DW_AT_name        : (indirect string, offset: 0x3ae56): unsigned char
 <1><51>: Abbrev Number: 3 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0x2da2): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4186e): __uint16_t
    <5d>   DW_AT_decl_file   : 2
    <5e>   DW_AT_decl_line   : 57
    <5f>   DW_AT_decl_column : 25
    <60>   DW_AT_type        : <0x64>
 <1><64>: Abbrev Number: 3 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 2
    <66>   DW_AT_encoding    : 7	(unsigned)
    <67>   DW_AT_name        : (indirect string, offset: 0x292ee): short unsigned int
 <1><6b>: Abbrev Number: 3 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 4
    <6d>   DW_AT_encoding    : 5	(signed)
    <6e>   DW_AT_name        : (indirect string, offset: 0xfa95): long int
 <1><72>: Abbrev Number: 4 (DW_TAG_typedef)
    <73>   DW_AT_name        : (indirect string, offset: 0x239db): __uint32_t
    <77>   DW_AT_decl_file   : 2
    <78>   DW_AT_decl_line   : 79
    <79>   DW_AT_decl_column : 25
    <7a>   DW_AT_type        : <0x7e>
 <1><7e>: Abbrev Number: 3 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 4
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x3067d): long unsigned int
 <1><85>: Abbrev Number: 3 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 8
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : (indirect string, offset: 0x2037c): long long int
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 8
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x2be12): long long unsigned int
 <1><93>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <94>   DW_AT_byte_size   : 4
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 1
    <9b>   DW_AT_encoding    : 8	(unsigned char)
    <9c>   DW_AT_name        : (indirect string, offset: 0x3cff3): char
 <1><a0>: Abbrev Number: 6 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x99>
 <1><a5>: Abbrev Number: 3 (DW_TAG_base_type)
    <a6>   DW_AT_byte_size   : 4
    <a7>   DW_AT_encoding    : 4	(float)
    <a8>   DW_AT_name        : (indirect string, offset: 0x4a39b): float
 <1><ac>: Abbrev Number: 3 (DW_TAG_base_type)
    <ad>   DW_AT_byte_size   : 8
    <ae>   DW_AT_encoding    : 4	(float)
    <af>   DW_AT_name        : (indirect string, offset: 0x184e5): double
 <1><b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x486e): uint8_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 24
    <ba>   DW_AT_decl_column : 19
    <bb>   DW_AT_type        : <0x3e>
 <1><bf>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <c0>   DW_AT_type        : <0xb3>
 <1><c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x41870): uint16_t
    <c9>   DW_AT_decl_file   : 3
    <ca>   DW_AT_decl_line   : 36
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x58>
 <1><d0>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d1>   DW_AT_type        : <0xc4>
 <1><d5>: Abbrev Number: 4 (DW_TAG_typedef)
    <d6>   DW_AT_name        : (indirect string, offset: 0x239dd): uint32_t
    <da>   DW_AT_decl_file   : 3
    <db>   DW_AT_decl_line   : 48
    <dc>   DW_AT_decl_column : 20
    <dd>   DW_AT_type        : <0x72>
 <1><e1>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e2>   DW_AT_type        : <0xd5>
 <1><e6>: Abbrev Number: 6 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xd5>
 <1><eb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ec>   DW_AT_byte_size   : 3588
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 132
    <f0>   DW_AT_decl_column : 9
    <f1>   DW_AT_sibling     : <0x1a7>
 <2><f5>: Abbrev Number: 9 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0xe705): ISER
    <fa>   DW_AT_decl_file   : 4
    <fb>   DW_AT_decl_line   : 134
    <fc>   DW_AT_decl_column : 17
    <fd>   DW_AT_type        : <0x1b7>
    <101>   DW_AT_data_member_location: 0
 <2><102>: Abbrev Number: 9 (DW_TAG_member)
    <103>   DW_AT_name        : (indirect string, offset: 0x344fd): RESERVED0
    <107>   DW_AT_decl_file   : 4
    <108>   DW_AT_decl_line   : 135
    <109>   DW_AT_decl_column : 17
    <10a>   DW_AT_type        : <0x1bc>
    <10e>   DW_AT_data_member_location: 32
 <2><10f>: Abbrev Number: 9 (DW_TAG_member)
    <110>   DW_AT_name        : (indirect string, offset: 0x40479): ICER
    <114>   DW_AT_decl_file   : 4
    <115>   DW_AT_decl_line   : 136
    <116>   DW_AT_decl_column : 17
    <117>   DW_AT_type        : <0x1b7>
    <11b>   DW_AT_data_member_location: 128
 <2><11c>: Abbrev Number: 9 (DW_TAG_member)
    <11d>   DW_AT_name        : (indirect string, offset: 0x4b983): RSERVED1
    <121>   DW_AT_decl_file   : 4
    <122>   DW_AT_decl_line   : 137
    <123>   DW_AT_decl_column : 17
    <124>   DW_AT_type        : <0x1bc>
    <128>   DW_AT_data_member_location: 160
 <2><129>: Abbrev Number: 10 (DW_TAG_member)
    <12a>   DW_AT_name        : (indirect string, offset: 0x1f2e6): ISPR
    <12e>   DW_AT_decl_file   : 4
    <12f>   DW_AT_decl_line   : 138
    <130>   DW_AT_decl_column : 17
    <131>   DW_AT_type        : <0x1b7>
    <135>   DW_AT_data_member_location: 256
 <2><137>: Abbrev Number: 10 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x34511): RESERVED2
    <13c>   DW_AT_decl_file   : 4
    <13d>   DW_AT_decl_line   : 139
    <13e>   DW_AT_decl_column : 17
    <13f>   DW_AT_type        : <0x1bc>
    <143>   DW_AT_data_member_location: 288
 <2><145>: Abbrev Number: 10 (DW_TAG_member)
    <146>   DW_AT_name        : (indirect string, offset: 0x440cf): ICPR
    <14a>   DW_AT_decl_file   : 4
    <14b>   DW_AT_decl_line   : 140
    <14c>   DW_AT_decl_column : 17
    <14d>   DW_AT_type        : <0x1b7>
    <151>   DW_AT_data_member_location: 384
 <2><153>: Abbrev Number: 10 (DW_TAG_member)
    <154>   DW_AT_name        : (indirect string, offset: 0x3451b): RESERVED3
    <158>   DW_AT_decl_file   : 4
    <159>   DW_AT_decl_line   : 141
    <15a>   DW_AT_decl_column : 17
    <15b>   DW_AT_type        : <0x1bc>
    <15f>   DW_AT_data_member_location: 416
 <2><161>: Abbrev Number: 10 (DW_TAG_member)
    <162>   DW_AT_name        : (indirect string, offset: 0x20e13): IABR
    <166>   DW_AT_decl_file   : 4
    <167>   DW_AT_decl_line   : 142
    <168>   DW_AT_decl_column : 17
    <169>   DW_AT_type        : <0x1b7>
    <16d>   DW_AT_data_member_location: 512
 <2><16f>: Abbrev Number: 10 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0x34525): RESERVED4
    <174>   DW_AT_decl_file   : 4
    <175>   DW_AT_decl_line   : 143
    <176>   DW_AT_decl_column : 17
    <177>   DW_AT_type        : <0x1cc>
    <17b>   DW_AT_data_member_location: 544
 <2><17d>: Abbrev Number: 11 (DW_TAG_member)
    <17e>   DW_AT_name        : IP
    <181>   DW_AT_decl_file   : 4
    <182>   DW_AT_decl_line   : 144
    <183>   DW_AT_decl_column : 17
    <184>   DW_AT_type        : <0x1ec>
    <188>   DW_AT_data_member_location: 768
 <2><18a>: Abbrev Number: 10 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x3452f): RESERVED5
    <18f>   DW_AT_decl_file   : 4
    <190>   DW_AT_decl_line   : 145
    <191>   DW_AT_decl_column : 17
    <192>   DW_AT_type        : <0x1f1>
    <196>   DW_AT_data_member_location: 1008
 <2><198>: Abbrev Number: 10 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x6276): STIR
    <19d>   DW_AT_decl_file   : 4
    <19e>   DW_AT_decl_line   : 146
    <19f>   DW_AT_decl_column : 17
    <1a0>   DW_AT_type        : <0xe1>
    <1a4>   DW_AT_data_member_location: 3584
 <2><1a6>: Abbrev Number: 0
 <1><1a7>: Abbrev Number: 12 (DW_TAG_array_type)
    <1a8>   DW_AT_type        : <0xe1>
    <1ac>   DW_AT_sibling     : <0x1b7>
 <2><1b0>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1b1>   DW_AT_type        : <0x30>
    <1b5>   DW_AT_upper_bound : 7
 <2><1b6>: Abbrev Number: 0
 <1><1b7>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <1b8>   DW_AT_type        : <0x1a7>
 <1><1bc>: Abbrev Number: 12 (DW_TAG_array_type)
    <1bd>   DW_AT_type        : <0xd5>
    <1c1>   DW_AT_sibling     : <0x1cc>
 <2><1c5>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1c6>   DW_AT_type        : <0x30>
    <1ca>   DW_AT_upper_bound : 23
 <2><1cb>: Abbrev Number: 0
 <1><1cc>: Abbrev Number: 12 (DW_TAG_array_type)
    <1cd>   DW_AT_type        : <0xd5>
    <1d1>   DW_AT_sibling     : <0x1dc>
 <2><1d5>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1d6>   DW_AT_type        : <0x30>
    <1da>   DW_AT_upper_bound : 55
 <2><1db>: Abbrev Number: 0
 <1><1dc>: Abbrev Number: 12 (DW_TAG_array_type)
    <1dd>   DW_AT_type        : <0xbf>
    <1e1>   DW_AT_sibling     : <0x1ec>
 <2><1e5>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1e6>   DW_AT_type        : <0x30>
    <1ea>   DW_AT_upper_bound : 239
 <2><1eb>: Abbrev Number: 0
 <1><1ec>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <1ed>   DW_AT_type        : <0x1dc>
 <1><1f1>: Abbrev Number: 12 (DW_TAG_array_type)
    <1f2>   DW_AT_type        : <0xd5>
    <1f6>   DW_AT_sibling     : <0x202>
 <2><1fa>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <1fb>   DW_AT_type        : <0x30>
    <1ff>   DW_AT_upper_bound : 643
 <2><201>: Abbrev Number: 0
 <1><202>: Abbrev Number: 4 (DW_TAG_typedef)
    <203>   DW_AT_name        : (indirect string, offset: 0x956c): NVIC_Type
    <207>   DW_AT_decl_file   : 4
    <208>   DW_AT_decl_line   : 147
    <209>   DW_AT_decl_column : 4
    <20a>   DW_AT_type        : <0xeb>
 <1><20e>: Abbrev Number: 15 (DW_TAG_structure_type)
    <20f>   DW_AT_byte_size   : 8
    <210>   DW_AT_decl_file   : 5
    <211>   DW_AT_decl_line   : 806
    <213>   DW_AT_decl_column : 9
    <214>   DW_AT_sibling     : <0x235>
 <2><218>: Abbrev Number: 16 (DW_TAG_member)
    <219>   DW_AT_name        : ISR
    <21d>   DW_AT_decl_file   : 5
    <21e>   DW_AT_decl_line   : 808
    <220>   DW_AT_decl_column : 17
    <221>   DW_AT_type        : <0xe1>
    <225>   DW_AT_data_member_location: 0
 <2><226>: Abbrev Number: 17 (DW_TAG_member)
    <227>   DW_AT_name        : (indirect string, offset: 0x324c6): IFCR
    <22b>   DW_AT_decl_file   : 5
    <22c>   DW_AT_decl_line   : 809
    <22e>   DW_AT_decl_column : 17
    <22f>   DW_AT_type        : <0xe1>
    <233>   DW_AT_data_member_location: 4
 <2><234>: Abbrev Number: 0
 <1><235>: Abbrev Number: 18 (DW_TAG_typedef)
    <236>   DW_AT_name        : (indirect string, offset: 0x85e): DMA_TypeDef
    <23a>   DW_AT_decl_file   : 5
    <23b>   DW_AT_decl_line   : 810
    <23d>   DW_AT_decl_column : 3
    <23e>   DW_AT_type        : <0x20e>
 <1><242>: Abbrev Number: 15 (DW_TAG_structure_type)
    <243>   DW_AT_byte_size   : 24
    <244>   DW_AT_decl_file   : 5
    <245>   DW_AT_decl_line   : 887
    <247>   DW_AT_decl_column : 9
    <248>   DW_AT_sibling     : <0x2a0>
 <2><24c>: Abbrev Number: 16 (DW_TAG_member)
    <24d>   DW_AT_name        : IMR
    <251>   DW_AT_decl_file   : 5
    <252>   DW_AT_decl_line   : 889
    <254>   DW_AT_decl_column : 17
    <255>   DW_AT_type        : <0xe1>
    <259>   DW_AT_data_member_location: 0
 <2><25a>: Abbrev Number: 16 (DW_TAG_member)
    <25b>   DW_AT_name        : EMR
    <25f>   DW_AT_decl_file   : 5
    <260>   DW_AT_decl_line   : 890
    <262>   DW_AT_decl_column : 17
    <263>   DW_AT_type        : <0xe1>
    <267>   DW_AT_data_member_location: 4
 <2><268>: Abbrev Number: 17 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3d679): RTSR
    <26d>   DW_AT_decl_file   : 5
    <26e>   DW_AT_decl_line   : 891
    <270>   DW_AT_decl_column : 17
    <271>   DW_AT_type        : <0xe1>
    <275>   DW_AT_data_member_location: 8
 <2><276>: Abbrev Number: 17 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0xb6f8): FTSR
    <27b>   DW_AT_decl_file   : 5
    <27c>   DW_AT_decl_line   : 892
    <27e>   DW_AT_decl_column : 17
    <27f>   DW_AT_type        : <0xe1>
    <283>   DW_AT_data_member_location: 12
 <2><284>: Abbrev Number: 17 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x38435): SWIER
    <289>   DW_AT_decl_file   : 5
    <28a>   DW_AT_decl_line   : 893
    <28c>   DW_AT_decl_column : 17
    <28d>   DW_AT_type        : <0xe1>
    <291>   DW_AT_data_member_location: 16
 <2><292>: Abbrev Number: 16 (DW_TAG_member)
    <293>   DW_AT_name        : PR
    <296>   DW_AT_decl_file   : 5
    <297>   DW_AT_decl_line   : 894
    <299>   DW_AT_decl_column : 17
    <29a>   DW_AT_type        : <0xe1>
    <29e>   DW_AT_data_member_location: 20
 <2><29f>: Abbrev Number: 0
 <1><2a0>: Abbrev Number: 18 (DW_TAG_typedef)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x128c9): EXTI_TypeDef
    <2a5>   DW_AT_decl_file   : 5
    <2a6>   DW_AT_decl_line   : 895
    <2a8>   DW_AT_decl_column : 3
    <2a9>   DW_AT_type        : <0x242>
 <1><2ad>: Abbrev Number: 15 (DW_TAG_structure_type)
    <2ae>   DW_AT_byte_size   : 28
    <2af>   DW_AT_decl_file   : 5
    <2b0>   DW_AT_decl_line   : 1001
    <2b2>   DW_AT_decl_column : 9
    <2b3>   DW_AT_sibling     : <0x31a>
 <2><2b7>: Abbrev Number: 16 (DW_TAG_member)
    <2b8>   DW_AT_name        : CRL
    <2bc>   DW_AT_decl_file   : 5
    <2bd>   DW_AT_decl_line   : 1003
    <2bf>   DW_AT_decl_column : 17
    <2c0>   DW_AT_type        : <0xe1>
    <2c4>   DW_AT_data_member_location: 0
 <2><2c5>: Abbrev Number: 16 (DW_TAG_member)
    <2c6>   DW_AT_name        : CRH
    <2ca>   DW_AT_decl_file   : 5
    <2cb>   DW_AT_decl_line   : 1004
    <2cd>   DW_AT_decl_column : 17
    <2ce>   DW_AT_type        : <0xe1>
    <2d2>   DW_AT_data_member_location: 4
 <2><2d3>: Abbrev Number: 16 (DW_TAG_member)
    <2d4>   DW_AT_name        : IDR
    <2d8>   DW_AT_decl_file   : 5
    <2d9>   DW_AT_decl_line   : 1005
    <2db>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xe1>
    <2e0>   DW_AT_data_member_location: 8
 <2><2e1>: Abbrev Number: 16 (DW_TAG_member)
    <2e2>   DW_AT_name        : ODR
    <2e6>   DW_AT_decl_file   : 5
    <2e7>   DW_AT_decl_line   : 1006
    <2e9>   DW_AT_decl_column : 17
    <2ea>   DW_AT_type        : <0xe1>
    <2ee>   DW_AT_data_member_location: 12
 <2><2ef>: Abbrev Number: 17 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x39e50): BSRR
    <2f4>   DW_AT_decl_file   : 5
    <2f5>   DW_AT_decl_line   : 1007
    <2f7>   DW_AT_decl_column : 17
    <2f8>   DW_AT_type        : <0xe1>
    <2fc>   DW_AT_data_member_location: 16
 <2><2fd>: Abbrev Number: 16 (DW_TAG_member)
    <2fe>   DW_AT_name        : BRR
    <302>   DW_AT_decl_file   : 5
    <303>   DW_AT_decl_line   : 1008
    <305>   DW_AT_decl_column : 17
    <306>   DW_AT_type        : <0xe1>
    <30a>   DW_AT_data_member_location: 20
 <2><30b>: Abbrev Number: 17 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x49015): LCKR
    <310>   DW_AT_decl_file   : 5
    <311>   DW_AT_decl_line   : 1009
    <313>   DW_AT_decl_column : 17
    <314>   DW_AT_type        : <0xe1>
    <318>   DW_AT_data_member_location: 24
 <2><319>: Abbrev Number: 0
 <1><31a>: Abbrev Number: 18 (DW_TAG_typedef)
    <31b>   DW_AT_name        : (indirect string, offset: 0x42dcb): GPIO_TypeDef
    <31f>   DW_AT_decl_file   : 5
    <320>   DW_AT_decl_line   : 1010
    <322>   DW_AT_decl_column : 3
    <323>   DW_AT_type        : <0x2ad>
 <1><327>: Abbrev Number: 15 (DW_TAG_structure_type)
    <328>   DW_AT_byte_size   : 32
    <329>   DW_AT_decl_file   : 5
    <32a>   DW_AT_decl_line   : 1016
    <32c>   DW_AT_decl_column : 9
    <32d>   DW_AT_sibling     : <0x378>
 <2><331>: Abbrev Number: 17 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x2d535): EVCR
    <336>   DW_AT_decl_file   : 5
    <337>   DW_AT_decl_line   : 1018
    <339>   DW_AT_decl_column : 17
    <33a>   DW_AT_type        : <0xe1>
    <33e>   DW_AT_data_member_location: 0
 <2><33f>: Abbrev Number: 17 (DW_TAG_member)
    <340>   DW_AT_name        : (indirect string, offset: 0x3bd9f): MAPR
    <344>   DW_AT_decl_file   : 5
    <345>   DW_AT_decl_line   : 1019
    <347>   DW_AT_decl_column : 17
    <348>   DW_AT_type        : <0xe1>
    <34c>   DW_AT_data_member_location: 4
 <2><34d>: Abbrev Number: 17 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x2266b): EXTICR
    <352>   DW_AT_decl_file   : 5
    <353>   DW_AT_decl_line   : 1020
    <355>   DW_AT_decl_column : 17
    <356>   DW_AT_type        : <0x388>
    <35a>   DW_AT_data_member_location: 8
 <2><35b>: Abbrev Number: 17 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x344fd): RESERVED0
    <360>   DW_AT_decl_file   : 5
    <361>   DW_AT_decl_line   : 1021
    <363>   DW_AT_decl_column : 12
    <364>   DW_AT_type        : <0xd5>
    <368>   DW_AT_data_member_location: 24
 <2><369>: Abbrev Number: 17 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0x45d2): MAPR2
    <36e>   DW_AT_decl_file   : 5
    <36f>   DW_AT_decl_line   : 1022
    <371>   DW_AT_decl_column : 17
    <372>   DW_AT_type        : <0xe1>
    <376>   DW_AT_data_member_location: 28
 <2><377>: Abbrev Number: 0
 <1><378>: Abbrev Number: 12 (DW_TAG_array_type)
    <379>   DW_AT_type        : <0xe1>
    <37d>   DW_AT_sibling     : <0x388>
 <2><381>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <382>   DW_AT_type        : <0x30>
    <386>   DW_AT_upper_bound : 3
 <2><387>: Abbrev Number: 0
 <1><388>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <389>   DW_AT_type        : <0x378>
 <1><38d>: Abbrev Number: 18 (DW_TAG_typedef)
    <38e>   DW_AT_name        : (indirect string, offset: 0x1b241): AFIO_TypeDef
    <392>   DW_AT_decl_file   : 5
    <393>   DW_AT_decl_line   : 1023
    <395>   DW_AT_decl_column : 3
    <396>   DW_AT_type        : <0x327>
 <1><39a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <39b>   DW_AT_byte_size   : 8
    <39c>   DW_AT_decl_file   : 5
    <39d>   DW_AT_decl_line   : 1066
    <39f>   DW_AT_decl_column : 9
    <3a0>   DW_AT_sibling     : <0x3c0>
 <2><3a4>: Abbrev Number: 16 (DW_TAG_member)
    <3a5>   DW_AT_name        : CR
    <3a8>   DW_AT_decl_file   : 5
    <3a9>   DW_AT_decl_line   : 1068
    <3ab>   DW_AT_decl_column : 17
    <3ac>   DW_AT_type        : <0xe1>
    <3b0>   DW_AT_data_member_location: 0
 <2><3b1>: Abbrev Number: 16 (DW_TAG_member)
    <3b2>   DW_AT_name        : CSR
    <3b6>   DW_AT_decl_file   : 5
    <3b7>   DW_AT_decl_line   : 1069
    <3b9>   DW_AT_decl_column : 17
    <3ba>   DW_AT_type        : <0xe1>
    <3be>   DW_AT_data_member_location: 4
 <2><3bf>: Abbrev Number: 0
 <1><3c0>: Abbrev Number: 18 (DW_TAG_typedef)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x4a11e): PWR_TypeDef
    <3c5>   DW_AT_decl_file   : 5
    <3c6>   DW_AT_decl_line   : 1070
    <3c8>   DW_AT_decl_column : 3
    <3c9>   DW_AT_type        : <0x39a>
 <1><3cd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3ce>   DW_AT_byte_size   : 40
    <3cf>   DW_AT_decl_file   : 5
    <3d0>   DW_AT_decl_line   : 1076
    <3d2>   DW_AT_decl_column : 9
    <3d3>   DW_AT_sibling     : <0x463>
 <2><3d7>: Abbrev Number: 16 (DW_TAG_member)
    <3d8>   DW_AT_name        : CR
    <3db>   DW_AT_decl_file   : 5
    <3dc>   DW_AT_decl_line   : 1078
    <3de>   DW_AT_decl_column : 17
    <3df>   DW_AT_type        : <0xe1>
    <3e3>   DW_AT_data_member_location: 0
 <2><3e4>: Abbrev Number: 17 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x25f67): CFGR
    <3e9>   DW_AT_decl_file   : 5
    <3ea>   DW_AT_decl_line   : 1079
    <3ec>   DW_AT_decl_column : 17
    <3ed>   DW_AT_type        : <0xe1>
    <3f1>   DW_AT_data_member_location: 4
 <2><3f2>: Abbrev Number: 16 (DW_TAG_member)
    <3f3>   DW_AT_name        : CIR
    <3f7>   DW_AT_decl_file   : 5
    <3f8>   DW_AT_decl_line   : 1080
    <3fa>   DW_AT_decl_column : 17
    <3fb>   DW_AT_type        : <0xe1>
    <3ff>   DW_AT_data_member_location: 8
 <2><400>: Abbrev Number: 17 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x1b869): APB2RSTR
    <405>   DW_AT_decl_file   : 5
    <406>   DW_AT_decl_line   : 1081
    <408>   DW_AT_decl_column : 17
    <409>   DW_AT_type        : <0xe1>
    <40d>   DW_AT_data_member_location: 12
 <2><40e>: Abbrev Number: 17 (DW_TAG_member)
    <40f>   DW_AT_name        : (indirect string, offset: 0xef35): APB1RSTR
    <413>   DW_AT_decl_file   : 5
    <414>   DW_AT_decl_line   : 1082
    <416>   DW_AT_decl_column : 17
    <417>   DW_AT_type        : <0xe1>
    <41b>   DW_AT_data_member_location: 16
 <2><41c>: Abbrev Number: 17 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x39cbc): AHBENR
    <421>   DW_AT_decl_file   : 5
    <422>   DW_AT_decl_line   : 1083
    <424>   DW_AT_decl_column : 17
    <425>   DW_AT_type        : <0xe1>
    <429>   DW_AT_data_member_location: 20
 <2><42a>: Abbrev Number: 17 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x39d0a): APB2ENR
    <42f>   DW_AT_decl_file   : 5
    <430>   DW_AT_decl_line   : 1084
    <432>   DW_AT_decl_column : 17
    <433>   DW_AT_type        : <0xe1>
    <437>   DW_AT_data_member_location: 24
 <2><438>: Abbrev Number: 17 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0x170ce): APB1ENR
    <43d>   DW_AT_decl_file   : 5
    <43e>   DW_AT_decl_line   : 1085
    <440>   DW_AT_decl_column : 17
    <441>   DW_AT_type        : <0xe1>
    <445>   DW_AT_data_member_location: 28
 <2><446>: Abbrev Number: 17 (DW_TAG_member)
    <447>   DW_AT_name        : (indirect string, offset: 0x5071b): BDCR
    <44b>   DW_AT_decl_file   : 5
    <44c>   DW_AT_decl_line   : 1086
    <44e>   DW_AT_decl_column : 17
    <44f>   DW_AT_type        : <0xe1>
    <453>   DW_AT_data_member_location: 32
 <2><454>: Abbrev Number: 16 (DW_TAG_member)
    <455>   DW_AT_name        : CSR
    <459>   DW_AT_decl_file   : 5
    <45a>   DW_AT_decl_line   : 1087
    <45c>   DW_AT_decl_column : 17
    <45d>   DW_AT_type        : <0xe1>
    <461>   DW_AT_data_member_location: 36
 <2><462>: Abbrev Number: 0
 <1><463>: Abbrev Number: 18 (DW_TAG_typedef)
    <464>   DW_AT_name        : (indirect string, offset: 0x10049): RCC_TypeDef
    <468>   DW_AT_decl_file   : 5
    <469>   DW_AT_decl_line   : 1098
    <46b>   DW_AT_decl_column : 3
    <46c>   DW_AT_type        : <0x3cd>
 <1><470>: Abbrev Number: 15 (DW_TAG_structure_type)
    <471>   DW_AT_byte_size   : 40
    <472>   DW_AT_decl_file   : 5
    <473>   DW_AT_decl_line   : 1104
    <475>   DW_AT_decl_column : 9
    <476>   DW_AT_sibling     : <0x593>
 <2><47a>: Abbrev Number: 16 (DW_TAG_member)
    <47b>   DW_AT_name        : CRH
    <47f>   DW_AT_decl_file   : 5
    <480>   DW_AT_decl_line   : 1106
    <482>   DW_AT_decl_column : 17
    <483>   DW_AT_type        : <0xd0>
    <487>   DW_AT_data_member_location: 0
 <2><488>: Abbrev Number: 17 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0x344fd): RESERVED0
    <48d>   DW_AT_decl_file   : 5
    <48e>   DW_AT_decl_line   : 1107
    <490>   DW_AT_decl_column : 13
    <491>   DW_AT_type        : <0xc4>
    <495>   DW_AT_data_member_location: 2
 <2><496>: Abbrev Number: 16 (DW_TAG_member)
    <497>   DW_AT_name        : CRL
    <49b>   DW_AT_decl_file   : 5
    <49c>   DW_AT_decl_line   : 1108
    <49e>   DW_AT_decl_column : 17
    <49f>   DW_AT_type        : <0xd0>
    <4a3>   DW_AT_data_member_location: 4
 <2><4a4>: Abbrev Number: 17 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x34507): RESERVED1
    <4a9>   DW_AT_decl_file   : 5
    <4aa>   DW_AT_decl_line   : 1109
    <4ac>   DW_AT_decl_column : 13
    <4ad>   DW_AT_type        : <0xc4>
    <4b1>   DW_AT_data_member_location: 6
 <2><4b2>: Abbrev Number: 17 (DW_TAG_member)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x45a2d): PRLH
    <4b7>   DW_AT_decl_file   : 5
    <4b8>   DW_AT_decl_line   : 1110
    <4ba>   DW_AT_decl_column : 17
    <4bb>   DW_AT_type        : <0xd0>
    <4bf>   DW_AT_data_member_location: 8
 <2><4c0>: Abbrev Number: 17 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x34511): RESERVED2
    <4c5>   DW_AT_decl_file   : 5
    <4c6>   DW_AT_decl_line   : 1111
    <4c8>   DW_AT_decl_column : 13
    <4c9>   DW_AT_type        : <0xc4>
    <4cd>   DW_AT_data_member_location: 10
 <2><4ce>: Abbrev Number: 17 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x25794): PRLL
    <4d3>   DW_AT_decl_file   : 5
    <4d4>   DW_AT_decl_line   : 1112
    <4d6>   DW_AT_decl_column : 17
    <4d7>   DW_AT_type        : <0xd0>
    <4db>   DW_AT_data_member_location: 12
 <2><4dc>: Abbrev Number: 17 (DW_TAG_member)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x3451b): RESERVED3
    <4e1>   DW_AT_decl_file   : 5
    <4e2>   DW_AT_decl_line   : 1113
    <4e4>   DW_AT_decl_column : 13
    <4e5>   DW_AT_type        : <0xc4>
    <4e9>   DW_AT_data_member_location: 14
 <2><4ea>: Abbrev Number: 17 (DW_TAG_member)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x39a3d): DIVH
    <4ef>   DW_AT_decl_file   : 5
    <4f0>   DW_AT_decl_line   : 1114
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0xd0>
    <4f7>   DW_AT_data_member_location: 16
 <2><4f8>: Abbrev Number: 17 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x34525): RESERVED4
    <4fd>   DW_AT_decl_file   : 5
    <4fe>   DW_AT_decl_line   : 1115
    <500>   DW_AT_decl_column : 13
    <501>   DW_AT_type        : <0xc4>
    <505>   DW_AT_data_member_location: 18
 <2><506>: Abbrev Number: 17 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x39a61): DIVL
    <50b>   DW_AT_decl_file   : 5
    <50c>   DW_AT_decl_line   : 1116
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0xd0>
    <513>   DW_AT_data_member_location: 20
 <2><514>: Abbrev Number: 17 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0x3452f): RESERVED5
    <519>   DW_AT_decl_file   : 5
    <51a>   DW_AT_decl_line   : 1117
    <51c>   DW_AT_decl_column : 13
    <51d>   DW_AT_type        : <0xc4>
    <521>   DW_AT_data_member_location: 22
 <2><522>: Abbrev Number: 17 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x39bb9): CNTH
    <527>   DW_AT_decl_file   : 5
    <528>   DW_AT_decl_line   : 1118
    <52a>   DW_AT_decl_column : 17
    <52b>   DW_AT_type        : <0xd0>
    <52f>   DW_AT_data_member_location: 24
 <2><530>: Abbrev Number: 17 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0x9057): RESERVED6
    <535>   DW_AT_decl_file   : 5
    <536>   DW_AT_decl_line   : 1119
    <538>   DW_AT_decl_column : 13
    <539>   DW_AT_type        : <0xc4>
    <53d>   DW_AT_data_member_location: 26
 <2><53e>: Abbrev Number: 17 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x1b04c): CNTL
    <543>   DW_AT_decl_file   : 5
    <544>   DW_AT_decl_line   : 1120
    <546>   DW_AT_decl_column : 17
    <547>   DW_AT_type        : <0xd0>
    <54b>   DW_AT_data_member_location: 28
 <2><54c>: Abbrev Number: 17 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x3455d): RESERVED7
    <551>   DW_AT_decl_file   : 5
    <552>   DW_AT_decl_line   : 1121
    <554>   DW_AT_decl_column : 13
    <555>   DW_AT_type        : <0xc4>
    <559>   DW_AT_data_member_location: 30
 <2><55a>: Abbrev Number: 17 (DW_TAG_member)
    <55b>   DW_AT_name        : (indirect string, offset: 0x23463): ALRH
    <55f>   DW_AT_decl_file   : 5
    <560>   DW_AT_decl_line   : 1122
    <562>   DW_AT_decl_column : 17
    <563>   DW_AT_type        : <0xd0>
    <567>   DW_AT_data_member_location: 32
 <2><568>: Abbrev Number: 17 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x34567): RESERVED8
    <56d>   DW_AT_decl_file   : 5
    <56e>   DW_AT_decl_line   : 1123
    <570>   DW_AT_decl_column : 13
    <571>   DW_AT_type        : <0xc4>
    <575>   DW_AT_data_member_location: 34
 <2><576>: Abbrev Number: 17 (DW_TAG_member)
    <577>   DW_AT_name        : (indirect string, offset: 0x234ba): ALRL
    <57b>   DW_AT_decl_file   : 5
    <57c>   DW_AT_decl_line   : 1124
    <57e>   DW_AT_decl_column : 17
    <57f>   DW_AT_type        : <0xd0>
    <583>   DW_AT_data_member_location: 36
 <2><584>: Abbrev Number: 17 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x34571): RESERVED9
    <589>   DW_AT_decl_file   : 5
    <58a>   DW_AT_decl_line   : 1125
    <58c>   DW_AT_decl_column : 13
    <58d>   DW_AT_type        : <0xc4>
    <591>   DW_AT_data_member_location: 38
 <2><592>: Abbrev Number: 0
 <1><593>: Abbrev Number: 18 (DW_TAG_typedef)
    <594>   DW_AT_name        : (indirect string, offset: 0x2c911): RTC_TypeDef
    <598>   DW_AT_decl_file   : 5
    <599>   DW_AT_decl_line   : 1126
    <59b>   DW_AT_decl_column : 3
    <59c>   DW_AT_type        : <0x470>
 <1><5a0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <5a1>   DW_AT_byte_size   : 80
    <5a2>   DW_AT_decl_file   : 5
    <5a3>   DW_AT_decl_line   : 1186
    <5a5>   DW_AT_decl_column : 9
    <5a6>   DW_AT_sibling     : <0x7da>
 <2><5aa>: Abbrev Number: 16 (DW_TAG_member)
    <5ab>   DW_AT_name        : CR1
    <5af>   DW_AT_decl_file   : 5
    <5b0>   DW_AT_decl_line   : 1188
    <5b2>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0xd0>
    <5b7>   DW_AT_data_member_location: 0
 <2><5b8>: Abbrev Number: 17 (DW_TAG_member)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x344fd): RESERVED0
    <5bd>   DW_AT_decl_file   : 5
    <5be>   DW_AT_decl_line   : 1189
    <5c0>   DW_AT_decl_column : 13
    <5c1>   DW_AT_type        : <0xc4>
    <5c5>   DW_AT_data_member_location: 2
 <2><5c6>: Abbrev Number: 16 (DW_TAG_member)
    <5c7>   DW_AT_name        : CR2
    <5cb>   DW_AT_decl_file   : 5
    <5cc>   DW_AT_decl_line   : 1190
    <5ce>   DW_AT_decl_column : 17
    <5cf>   DW_AT_type        : <0xd0>
    <5d3>   DW_AT_data_member_location: 4
 <2><5d4>: Abbrev Number: 17 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x34507): RESERVED1
    <5d9>   DW_AT_decl_file   : 5
    <5da>   DW_AT_decl_line   : 1191
    <5dc>   DW_AT_decl_column : 13
    <5dd>   DW_AT_type        : <0xc4>
    <5e1>   DW_AT_data_member_location: 6
 <2><5e2>: Abbrev Number: 17 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0xaebf): SMCR
    <5e7>   DW_AT_decl_file   : 5
    <5e8>   DW_AT_decl_line   : 1192
    <5ea>   DW_AT_decl_column : 17
    <5eb>   DW_AT_type        : <0xd0>
    <5ef>   DW_AT_data_member_location: 8
 <2><5f0>: Abbrev Number: 17 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x34511): RESERVED2
    <5f5>   DW_AT_decl_file   : 5
    <5f6>   DW_AT_decl_line   : 1193
    <5f8>   DW_AT_decl_column : 13
    <5f9>   DW_AT_type        : <0xc4>
    <5fd>   DW_AT_data_member_location: 10
 <2><5fe>: Abbrev Number: 17 (DW_TAG_member)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x347c9): DIER
    <603>   DW_AT_decl_file   : 5
    <604>   DW_AT_decl_line   : 1194
    <606>   DW_AT_decl_column : 17
    <607>   DW_AT_type        : <0xd0>
    <60b>   DW_AT_data_member_location: 12
 <2><60c>: Abbrev Number: 17 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x3451b): RESERVED3
    <611>   DW_AT_decl_file   : 5
    <612>   DW_AT_decl_line   : 1195
    <614>   DW_AT_decl_column : 13
    <615>   DW_AT_type        : <0xc4>
    <619>   DW_AT_data_member_location: 14
 <2><61a>: Abbrev Number: 16 (DW_TAG_member)
    <61b>   DW_AT_name        : SR
    <61e>   DW_AT_decl_file   : 5
    <61f>   DW_AT_decl_line   : 1196
    <621>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0xd0>
    <626>   DW_AT_data_member_location: 16
 <2><627>: Abbrev Number: 17 (DW_TAG_member)
    <628>   DW_AT_name        : (indirect string, offset: 0x34525): RESERVED4
    <62c>   DW_AT_decl_file   : 5
    <62d>   DW_AT_decl_line   : 1197
    <62f>   DW_AT_decl_column : 13
    <630>   DW_AT_type        : <0xc4>
    <634>   DW_AT_data_member_location: 18
 <2><635>: Abbrev Number: 16 (DW_TAG_member)
    <636>   DW_AT_name        : EGR
    <63a>   DW_AT_decl_file   : 5
    <63b>   DW_AT_decl_line   : 1198
    <63d>   DW_AT_decl_column : 17
    <63e>   DW_AT_type        : <0xd0>
    <642>   DW_AT_data_member_location: 20
 <2><643>: Abbrev Number: 17 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x3452f): RESERVED5
    <648>   DW_AT_decl_file   : 5
    <649>   DW_AT_decl_line   : 1199
    <64b>   DW_AT_decl_column : 13
    <64c>   DW_AT_type        : <0xc4>
    <650>   DW_AT_data_member_location: 22
 <2><651>: Abbrev Number: 17 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x23325): CCMR1
    <656>   DW_AT_decl_file   : 5
    <657>   DW_AT_decl_line   : 1200
    <659>   DW_AT_decl_column : 17
    <65a>   DW_AT_type        : <0xd0>
    <65e>   DW_AT_data_member_location: 24
 <2><65f>: Abbrev Number: 17 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x9057): RESERVED6
    <664>   DW_AT_decl_file   : 5
    <665>   DW_AT_decl_line   : 1201
    <667>   DW_AT_decl_column : 13
    <668>   DW_AT_type        : <0xc4>
    <66c>   DW_AT_data_member_location: 26
 <2><66d>: Abbrev Number: 17 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x2332b): CCMR2
    <672>   DW_AT_decl_file   : 5
    <673>   DW_AT_decl_line   : 1202
    <675>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0xd0>
    <67a>   DW_AT_data_member_location: 28
 <2><67b>: Abbrev Number: 17 (DW_TAG_member)
    <67c>   DW_AT_name        : (indirect string, offset: 0x3455d): RESERVED7
    <680>   DW_AT_decl_file   : 5
    <681>   DW_AT_decl_line   : 1203
    <683>   DW_AT_decl_column : 13
    <684>   DW_AT_type        : <0xc4>
    <688>   DW_AT_data_member_location: 30
 <2><689>: Abbrev Number: 17 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x34399): CCER
    <68e>   DW_AT_decl_file   : 5
    <68f>   DW_AT_decl_line   : 1204
    <691>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0xd0>
    <696>   DW_AT_data_member_location: 32
 <2><697>: Abbrev Number: 17 (DW_TAG_member)
    <698>   DW_AT_name        : (indirect string, offset: 0x34567): RESERVED8
    <69c>   DW_AT_decl_file   : 5
    <69d>   DW_AT_decl_line   : 1205
    <69f>   DW_AT_decl_column : 13
    <6a0>   DW_AT_type        : <0xc4>
    <6a4>   DW_AT_data_member_location: 34
 <2><6a5>: Abbrev Number: 16 (DW_TAG_member)
    <6a6>   DW_AT_name        : CNT
    <6aa>   DW_AT_decl_file   : 5
    <6ab>   DW_AT_decl_line   : 1206
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0xd0>
    <6b2>   DW_AT_data_member_location: 36
 <2><6b3>: Abbrev Number: 17 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x34571): RESERVED9
    <6b8>   DW_AT_decl_file   : 5
    <6b9>   DW_AT_decl_line   : 1207
    <6bb>   DW_AT_decl_column : 13
    <6bc>   DW_AT_type        : <0xc4>
    <6c0>   DW_AT_data_member_location: 38
 <2><6c1>: Abbrev Number: 16 (DW_TAG_member)
    <6c2>   DW_AT_name        : PSC
    <6c6>   DW_AT_decl_file   : 5
    <6c7>   DW_AT_decl_line   : 1208
    <6c9>   DW_AT_decl_column : 17
    <6ca>   DW_AT_type        : <0xd0>
    <6ce>   DW_AT_data_member_location: 40
 <2><6cf>: Abbrev Number: 17 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0x2396d): RESERVED10
    <6d4>   DW_AT_decl_file   : 5
    <6d5>   DW_AT_decl_line   : 1209
    <6d7>   DW_AT_decl_column : 13
    <6d8>   DW_AT_type        : <0xc4>
    <6dc>   DW_AT_data_member_location: 42
 <2><6dd>: Abbrev Number: 16 (DW_TAG_member)
    <6de>   DW_AT_name        : ARR
    <6e2>   DW_AT_decl_file   : 5
    <6e3>   DW_AT_decl_line   : 1210
    <6e5>   DW_AT_decl_column : 17
    <6e6>   DW_AT_type        : <0xd0>
    <6ea>   DW_AT_data_member_location: 44
 <2><6eb>: Abbrev Number: 17 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x23978): RESERVED11
    <6f0>   DW_AT_decl_file   : 5
    <6f1>   DW_AT_decl_line   : 1211
    <6f3>   DW_AT_decl_column : 13
    <6f4>   DW_AT_type        : <0xc4>
    <6f8>   DW_AT_data_member_location: 46
 <2><6f9>: Abbrev Number: 16 (DW_TAG_member)
    <6fa>   DW_AT_name        : RCR
    <6fe>   DW_AT_decl_file   : 5
    <6ff>   DW_AT_decl_line   : 1212
    <701>   DW_AT_decl_column : 17
    <702>   DW_AT_type        : <0xd0>
    <706>   DW_AT_data_member_location: 48
 <2><707>: Abbrev Number: 17 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x23983): RESERVED12
    <70c>   DW_AT_decl_file   : 5
    <70d>   DW_AT_decl_line   : 1213
    <70f>   DW_AT_decl_column : 13
    <710>   DW_AT_type        : <0xc4>
    <714>   DW_AT_data_member_location: 50
 <2><715>: Abbrev Number: 17 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0x380b4): CCR1
    <71a>   DW_AT_decl_file   : 5
    <71b>   DW_AT_decl_line   : 1214
    <71d>   DW_AT_decl_column : 17
    <71e>   DW_AT_type        : <0xd0>
    <722>   DW_AT_data_member_location: 52
 <2><723>: Abbrev Number: 17 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x2398e): RESERVED13
    <728>   DW_AT_decl_file   : 5
    <729>   DW_AT_decl_line   : 1215
    <72b>   DW_AT_decl_column : 13
    <72c>   DW_AT_type        : <0xc4>
    <730>   DW_AT_data_member_location: 54
 <2><731>: Abbrev Number: 17 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x173c4): CCR2
    <736>   DW_AT_decl_file   : 5
    <737>   DW_AT_decl_line   : 1216
    <739>   DW_AT_decl_column : 17
    <73a>   DW_AT_type        : <0xd0>
    <73e>   DW_AT_data_member_location: 56
 <2><73f>: Abbrev Number: 17 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x23999): RESERVED14
    <744>   DW_AT_decl_file   : 5
    <745>   DW_AT_decl_line   : 1217
    <747>   DW_AT_decl_column : 13
    <748>   DW_AT_type        : <0xc4>
    <74c>   DW_AT_data_member_location: 58
 <2><74d>: Abbrev Number: 17 (DW_TAG_member)
    <74e>   DW_AT_name        : (indirect string, offset: 0x380de): CCR3
    <752>   DW_AT_decl_file   : 5
    <753>   DW_AT_decl_line   : 1218
    <755>   DW_AT_decl_column : 17
    <756>   DW_AT_type        : <0xd0>
    <75a>   DW_AT_data_member_location: 60
 <2><75b>: Abbrev Number: 17 (DW_TAG_member)
    <75c>   DW_AT_name        : (indirect string, offset: 0x239a4): RESERVED15
    <760>   DW_AT_decl_file   : 5
    <761>   DW_AT_decl_line   : 1219
    <763>   DW_AT_decl_column : 13
    <764>   DW_AT_type        : <0xc4>
    <768>   DW_AT_data_member_location: 62
 <2><769>: Abbrev Number: 17 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0x380e3): CCR4
    <76e>   DW_AT_decl_file   : 5
    <76f>   DW_AT_decl_line   : 1220
    <771>   DW_AT_decl_column : 17
    <772>   DW_AT_type        : <0xd0>
    <776>   DW_AT_data_member_location: 64
 <2><777>: Abbrev Number: 17 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x239af): RESERVED16
    <77c>   DW_AT_decl_file   : 5
    <77d>   DW_AT_decl_line   : 1221
    <77f>   DW_AT_decl_column : 13
    <780>   DW_AT_type        : <0xc4>
    <784>   DW_AT_data_member_location: 66
 <2><785>: Abbrev Number: 17 (DW_TAG_member)
    <786>   DW_AT_name        : (indirect string, offset: 0xacc4): BDTR
    <78a>   DW_AT_decl_file   : 5
    <78b>   DW_AT_decl_line   : 1222
    <78d>   DW_AT_decl_column : 17
    <78e>   DW_AT_type        : <0xd0>
    <792>   DW_AT_data_member_location: 68
 <2><793>: Abbrev Number: 17 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0x239ba): RESERVED17
    <798>   DW_AT_decl_file   : 5
    <799>   DW_AT_decl_line   : 1223
    <79b>   DW_AT_decl_column : 13
    <79c>   DW_AT_type        : <0xc4>
    <7a0>   DW_AT_data_member_location: 70
 <2><7a1>: Abbrev Number: 16 (DW_TAG_member)
    <7a2>   DW_AT_name        : DCR
    <7a6>   DW_AT_decl_file   : 5
    <7a7>   DW_AT_decl_line   : 1224
    <7a9>   DW_AT_decl_column : 17
    <7aa>   DW_AT_type        : <0xd0>
    <7ae>   DW_AT_data_member_location: 72
 <2><7af>: Abbrev Number: 17 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x239c5): RESERVED18
    <7b4>   DW_AT_decl_file   : 5
    <7b5>   DW_AT_decl_line   : 1225
    <7b7>   DW_AT_decl_column : 13
    <7b8>   DW_AT_type        : <0xc4>
    <7bc>   DW_AT_data_member_location: 74
 <2><7bd>: Abbrev Number: 17 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x1d269): DMAR
    <7c2>   DW_AT_decl_file   : 5
    <7c3>   DW_AT_decl_line   : 1226
    <7c5>   DW_AT_decl_column : 17
    <7c6>   DW_AT_type        : <0xd0>
    <7ca>   DW_AT_data_member_location: 76
 <2><7cb>: Abbrev Number: 17 (DW_TAG_member)
    <7cc>   DW_AT_name        : (indirect string, offset: 0x239d0): RESERVED19
    <7d0>   DW_AT_decl_file   : 5
    <7d1>   DW_AT_decl_line   : 1227
    <7d3>   DW_AT_decl_column : 13
    <7d4>   DW_AT_type        : <0xc4>
    <7d8>   DW_AT_data_member_location: 78
 <2><7d9>: Abbrev Number: 0
 <1><7da>: Abbrev Number: 18 (DW_TAG_typedef)
    <7db>   DW_AT_name        : (indirect string, offset: 0x2c7b9): TIM_TypeDef
    <7df>   DW_AT_decl_file   : 5
    <7e0>   DW_AT_decl_line   : 1228
    <7e2>   DW_AT_decl_column : 3
    <7e3>   DW_AT_type        : <0x5a0>
 <1><7e7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7e8>   DW_AT_byte_size   : 33
    <7e9>   DW_AT_decl_file   : 6
    <7ea>   DW_AT_decl_line   : 9
    <7eb>   DW_AT_decl_column : 9
    <7ec>   DW_AT_sibling     : <0x825>
 <2><7f0>: Abbrev Number: 9 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x51207): time
    <7f5>   DW_AT_decl_file   : 6
    <7f6>   DW_AT_decl_line   : 10
    <7f7>   DW_AT_decl_column : 11
    <7f8>   DW_AT_type        : <0xd5>
    <7fc>   DW_AT_data_member_location: 0
 <2><7fd>: Abbrev Number: 9 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x3ddfc): ADC_channels
    <802>   DW_AT_decl_file   : 6
    <803>   DW_AT_decl_line   : 11
    <804>   DW_AT_decl_column : 11
    <805>   DW_AT_type        : <0x825>
    <809>   DW_AT_data_member_location: 4
 <2><80a>: Abbrev Number: 9 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x8303): flags
    <80f>   DW_AT_decl_file   : 6
    <810>   DW_AT_decl_line   : 12
    <811>   DW_AT_decl_column : 11
    <812>   DW_AT_type        : <0xd5>
    <816>   DW_AT_data_member_location: 28
 <2><817>: Abbrev Number: 20 (DW_TAG_member)
    <818>   DW_AT_name        : end
    <81c>   DW_AT_decl_file   : 6
    <81d>   DW_AT_decl_line   : 13
    <81e>   DW_AT_decl_column : 13
    <81f>   DW_AT_type        : <0xa0>
    <823>   DW_AT_data_member_location: 32
 <2><824>: Abbrev Number: 0
 <1><825>: Abbrev Number: 12 (DW_TAG_array_type)
    <826>   DW_AT_type        : <0xc4>
    <82a>   DW_AT_sibling     : <0x835>
 <2><82e>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <82f>   DW_AT_type        : <0x30>
    <833>   DW_AT_upper_bound : 11
 <2><834>: Abbrev Number: 0
 <1><835>: Abbrev Number: 4 (DW_TAG_typedef)
    <836>   DW_AT_name        : (indirect string, offset: 0x35b74): JOURNALING_DATA
    <83a>   DW_AT_decl_file   : 6
    <83b>   DW_AT_decl_line   : 14
    <83c>   DW_AT_decl_column : 3
    <83d>   DW_AT_type        : <0x7e7>
 <1><841>: Abbrev Number: 21 (DW_TAG_variable)
    <842>   DW_AT_name        : (indirect string, offset: 0x3cb14): sys_clock
    <846>   DW_AT_decl_file   : 6
    <847>   DW_AT_decl_line   : 16
    <848>   DW_AT_decl_column : 17
    <849>   DW_AT_type        : <0xd5>
    <84d>   DW_AT_external    : 1
    <84d>   DW_AT_declaration : 1
 <1><84d>: Abbrev Number: 21 (DW_TAG_variable)
    <84e>   DW_AT_name        : (indirect string, offset: 0x402a0): temperature
    <852>   DW_AT_decl_file   : 6
    <853>   DW_AT_decl_line   : 17
    <854>   DW_AT_decl_column : 17
    <855>   DW_AT_type        : <0xd5>
    <859>   DW_AT_external    : 1
    <859>   DW_AT_declaration : 1
 <1><859>: Abbrev Number: 21 (DW_TAG_variable)
    <85a>   DW_AT_name        : (indirect string, offset: 0x8303): flags
    <85e>   DW_AT_decl_file   : 6
    <85f>   DW_AT_decl_line   : 18
    <860>   DW_AT_decl_column : 17
    <861>   DW_AT_type        : <0xd5>
    <865>   DW_AT_external    : 1
    <865>   DW_AT_declaration : 1
 <1><865>: Abbrev Number: 21 (DW_TAG_variable)
    <866>   DW_AT_name        : (indirect string, offset: 0x2f973): ADC_average
    <86a>   DW_AT_decl_file   : 6
    <86b>   DW_AT_decl_line   : 19
    <86c>   DW_AT_decl_column : 17
    <86d>   DW_AT_type        : <0x825>
    <871>   DW_AT_external    : 1
    <871>   DW_AT_declaration : 1
 <1><871>: Abbrev Number: 21 (DW_TAG_variable)
    <872>   DW_AT_name        : (indirect string, offset: 0x47088): jdata
    <876>   DW_AT_decl_file   : 6
    <877>   DW_AT_decl_line   : 20
    <878>   DW_AT_decl_column : 24
    <879>   DW_AT_type        : <0x835>
    <87d>   DW_AT_external    : 1
    <87d>   DW_AT_declaration : 1
 <1><87d>: Abbrev Number: 12 (DW_TAG_array_type)
    <87e>   DW_AT_type        : <0x93>
    <882>   DW_AT_sibling     : <0x88d>
 <2><886>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <887>   DW_AT_type        : <0x30>
    <88b>   DW_AT_upper_bound : 31
 <2><88c>: Abbrev Number: 0
 <1><88d>: Abbrev Number: 21 (DW_TAG_variable)
    <88e>   DW_AT_name        : (indirect string, offset: 0x1f040): crontab
    <892>   DW_AT_decl_file   : 7
    <893>   DW_AT_decl_line   : 24
    <894>   DW_AT_decl_column : 14
    <895>   DW_AT_type        : <0x87d>
    <899>   DW_AT_external    : 1
    <899>   DW_AT_declaration : 1
 <1><899>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <89a>   DW_AT_byte_size   : 4
    <89b>   DW_AT_type        : <0xd5>
 <1><89f>: Abbrev Number: 22 (DW_TAG_variable)
    <8a0>   DW_AT_specification: <0x859>
    <8a4>   DW_AT_decl_file   : 1
    <8a5>   DW_AT_decl_line   : 12
    <8a6>   DW_AT_decl_column : 10
    <8a7>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><8ad>: Abbrev Number: 22 (DW_TAG_variable)
    <8ae>   DW_AT_specification: <0x841>
    <8b2>   DW_AT_decl_file   : 1
    <8b3>   DW_AT_decl_line   : 13
    <8b4>   DW_AT_decl_column : 10
    <8b5>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><8bb>: Abbrev Number: 22 (DW_TAG_variable)
    <8bc>   DW_AT_specification: <0x84d>
    <8c0>   DW_AT_decl_file   : 1
    <8c1>   DW_AT_decl_line   : 14
    <8c2>   DW_AT_decl_column : 10
    <8c3>   DW_AT_location    : 5 byte block: 3 10 0 0 20 	(DW_OP_addr: 20000010)
 <1><8c9>: Abbrev Number: 22 (DW_TAG_variable)
    <8ca>   DW_AT_specification: <0x871>
    <8ce>   DW_AT_decl_file   : 1
    <8cf>   DW_AT_decl_line   : 15
    <8d0>   DW_AT_decl_column : 17
    <8d1>   DW_AT_location    : 5 byte block: 3 14 0 0 20 	(DW_OP_addr: 20000014)
 <1><8d7>: Abbrev Number: 22 (DW_TAG_variable)
    <8d8>   DW_AT_specification: <0x865>
    <8dc>   DW_AT_decl_file   : 1
    <8dd>   DW_AT_decl_line   : 16
    <8de>   DW_AT_decl_column : 10
    <8df>   DW_AT_location    : 5 byte block: 3 38 0 0 20 	(DW_OP_addr: 20000038)
 <1><8e5>: Abbrev Number: 23 (DW_TAG_variable)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x55de): sys_time
    <8ea>   DW_AT_decl_file   : 1
    <8eb>   DW_AT_decl_line   : 18
    <8ec>   DW_AT_decl_column : 16
    <8ed>   DW_AT_type        : <0xe6>
    <8f1>   DW_AT_external    : 1
    <8f1>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><8f7>: Abbrev Number: 23 (DW_TAG_variable)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x45fbe): test_value
    <8fc>   DW_AT_decl_file   : 1
    <8fd>   DW_AT_decl_line   : 19
    <8fe>   DW_AT_decl_column : 11
    <8ff>   DW_AT_type        : <0x899>
    <903>   DW_AT_external    : 1
    <903>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><909>: Abbrev Number: 23 (DW_TAG_variable)
    <90a>   DW_AT_name        : (indirect string, offset: 0x23006): recent_time
    <90e>   DW_AT_decl_file   : 1
    <90f>   DW_AT_decl_line   : 21
    <910>   DW_AT_decl_column : 10
    <911>   DW_AT_type        : <0xd5>
    <915>   DW_AT_external    : 1
    <915>   DW_AT_location    : 5 byte block: 3 50 0 0 20 	(DW_OP_addr: 20000050)
 <1><91b>: Abbrev Number: 23 (DW_TAG_variable)
    <91c>   DW_AT_name        : (indirect string, offset: 0x4d45): recent_alarm
    <920>   DW_AT_decl_file   : 1
    <921>   DW_AT_decl_line   : 21
    <922>   DW_AT_decl_column : 23
    <923>   DW_AT_type        : <0xd5>
    <927>   DW_AT_external    : 1
    <927>   DW_AT_location    : 5 byte block: 3 54 0 0 20 	(DW_OP_addr: 20000054)
 <1><92d>: Abbrev Number: 24 (DW_TAG_subprogram)
    <92e>   DW_AT_external    : 1
    <92e>   DW_AT_name        : (indirect string, offset: 0x28840): clock_frequency_measure
    <932>   DW_AT_decl_file   : 1
    <933>   DW_AT_decl_line   : 227
    <934>   DW_AT_decl_column : 10
    <935>   DW_AT_type        : <0xd5>
    <939>   DW_AT_low_pc      : 0x8000680
    <93d>   DW_AT_high_pc     : 0x18c
    <941>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <943>   DW_AT_GNU_all_tail_call_sites: 1
    <943>   DW_AT_sibling     : <0x995>
 <2><947>: Abbrev Number: 25 (DW_TAG_variable)
    <948>   DW_AT_name        : (indirect string, offset: 0x3c613): TIM2_temp
    <94c>   DW_AT_decl_file   : 1
    <94d>   DW_AT_decl_line   : 229
    <94e>   DW_AT_decl_column : 14
    <94f>   DW_AT_type        : <0x7da>
    <953>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><957>: Abbrev Number: 25 (DW_TAG_variable)
    <958>   DW_AT_name        : (indirect string, offset: 0x4b70e): TIM3_temp
    <95c>   DW_AT_decl_file   : 1
    <95d>   DW_AT_decl_line   : 229
    <95e>   DW_AT_decl_column : 25
    <95f>   DW_AT_type        : <0x7da>
    <963>   DW_AT_location    : 3 byte block: 91 cc 7e 	(DW_OP_fbreg: -180)
 <2><967>: Abbrev Number: 25 (DW_TAG_variable)
    <968>   DW_AT_name        : (indirect string, offset: 0x463f6): TIM2_clk
    <96c>   DW_AT_decl_file   : 1
    <96d>   DW_AT_decl_line   : 230
    <96e>   DW_AT_decl_column : 11
    <96f>   DW_AT_type        : <0xd5>
    <973>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><976>: Abbrev Number: 25 (DW_TAG_variable)
    <977>   DW_AT_name        : (indirect string, offset: 0x22ad): TIM3_clk
    <97b>   DW_AT_decl_file   : 1
    <97c>   DW_AT_decl_line   : 231
    <97d>   DW_AT_decl_column : 11
    <97e>   DW_AT_type        : <0xd5>
    <982>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><985>: Abbrev Number: 25 (DW_TAG_variable)
    <986>   DW_AT_name        : (indirect string, offset: 0xb650): frequency
    <98a>   DW_AT_decl_file   : 1
    <98b>   DW_AT_decl_line   : 250
    <98c>   DW_AT_decl_column : 11
    <98d>   DW_AT_type        : <0xd5>
    <991>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><994>: Abbrev Number: 0
 <1><995>: Abbrev Number: 24 (DW_TAG_subprogram)
    <996>   DW_AT_external    : 1
    <996>   DW_AT_name        : (indirect string, offset: 0x183fa): main
    <99a>   DW_AT_decl_file   : 1
    <99b>   DW_AT_decl_line   : 25
    <99c>   DW_AT_decl_column : 5
    <99d>   DW_AT_type        : <0x29>
    <9a1>   DW_AT_low_pc      : 0x8000164
    <9a5>   DW_AT_high_pc     : 0x51c
    <9a9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ab>   DW_AT_GNU_all_tail_call_sites: 1
    <9ab>   DW_AT_sibling     : <0x9e0>
 <2><9af>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <9b0>   DW_AT_low_pc      : 0x80005d8
    <9b4>   DW_AT_high_pc     : 0x6e
 <3><9b8>: Abbrev Number: 25 (DW_TAG_variable)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x3de00): channels
    <9bd>   DW_AT_decl_file   : 1
    <9be>   DW_AT_decl_line   : 150
    <9bf>   DW_AT_decl_column : 14
    <9c0>   DW_AT_type        : <0x9e0>
    <9c4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><9c7>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <9c8>   DW_AT_low_pc      : 0x80005e2
    <9cc>   DW_AT_high_pc     : 0x3e
 <4><9d0>: Abbrev Number: 27 (DW_TAG_variable)
    <9d1>   DW_AT_name        : i
    <9d3>   DW_AT_decl_file   : 1
    <9d4>   DW_AT_decl_line   : 151
    <9d5>   DW_AT_decl_column : 13
    <9d6>   DW_AT_type        : <0x29>
    <9da>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <4><9dd>: Abbrev Number: 0
 <3><9de>: Abbrev Number: 0
 <2><9df>: Abbrev Number: 0
 <1><9e0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0xc4>
 <1><9e6>: Abbrev Number: 0
  Compilation Unit @ offset 0x9e7:
   Length:        0x153 (32-bit)
   Version:       4
   Abbrev Offset: 0x18c
   Pointer Size:  4
 <0><9f2>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9f3>   DW_AT_producer    : (indirect string, offset: 0xc71a): GNU C99 10.2.0 -mcpu=cortex-m3 -mthumb -mfloat-abi=soft -march=armv7-m -g3 -O0 -std=c99 -fdata-sections -ffunction-sections -fno-exceptions
    <9f7>   DW_AT_language    : 12	(ANSI C99)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x50bc5): startup.c
    <9fc>   DW_AT_comp_dir    : (indirect string, offset: 0x4413b): /home/leha/work/Electronics/HPS_growbox/BrygðiOS/Brig-iOS
    <a00>   DW_AT_ranges      : 0x18
    <a04>   DW_AT_low_pc      : 0x0
    <a08>   DW_AT_stmt_list   : 0x849
    <a0c>   DW_AT_GNU_macros  : 0xceb7
 <1><a10>: Abbrev Number: 2 (DW_TAG_base_type)
    <a11>   DW_AT_byte_size   : 1
    <a12>   DW_AT_encoding    : 6	(signed char)
    <a13>   DW_AT_name        : (indirect string, offset: 0x3cfec): signed char
 <1><a17>: Abbrev Number: 2 (DW_TAG_base_type)
    <a18>   DW_AT_byte_size   : 1
    <a19>   DW_AT_encoding    : 8	(unsigned char)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x3ae56): unsigned char
 <1><a1e>: Abbrev Number: 2 (DW_TAG_base_type)
    <a1f>   DW_AT_byte_size   : 2
    <a20>   DW_AT_encoding    : 5	(signed)
    <a21>   DW_AT_name        : (indirect string, offset: 0x2da2): short int
 <1><a25>: Abbrev Number: 2 (DW_TAG_base_type)
    <a26>   DW_AT_byte_size   : 2
    <a27>   DW_AT_encoding    : 7	(unsigned)
    <a28>   DW_AT_name        : (indirect string, offset: 0x292ee): short unsigned int
 <1><a2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <a2d>   DW_AT_byte_size   : 4
    <a2e>   DW_AT_encoding    : 5	(signed)
    <a2f>   DW_AT_name        : (indirect string, offset: 0xfa95): long int
 <1><a33>: Abbrev Number: 2 (DW_TAG_base_type)
    <a34>   DW_AT_byte_size   : 4
    <a35>   DW_AT_encoding    : 7	(unsigned)
    <a36>   DW_AT_name        : (indirect string, offset: 0x3067d): long unsigned int
 <1><a3a>: Abbrev Number: 2 (DW_TAG_base_type)
    <a3b>   DW_AT_byte_size   : 8
    <a3c>   DW_AT_encoding    : 5	(signed)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x2037c): long long int
 <1><a41>: Abbrev Number: 2 (DW_TAG_base_type)
    <a42>   DW_AT_byte_size   : 8
    <a43>   DW_AT_encoding    : 7	(unsigned)
    <a44>   DW_AT_name        : (indirect string, offset: 0x2be12): long long unsigned int
 <1><a48>: Abbrev Number: 3 (DW_TAG_base_type)
    <a49>   DW_AT_byte_size   : 4
    <a4a>   DW_AT_encoding    : 5	(signed)
    <a4b>   DW_AT_name        : int
 <1><a4f>: Abbrev Number: 2 (DW_TAG_base_type)
    <a50>   DW_AT_byte_size   : 4
    <a51>   DW_AT_encoding    : 7	(unsigned)
    <a52>   DW_AT_name        : (indirect string, offset: 0x2c338): unsigned int
 <1><a56>: Abbrev Number: 4 (DW_TAG_typedef)
    <a57>   DW_AT_name        : (indirect string, offset: 0x50bcf): intfunc
    <a5b>   DW_AT_decl_file   : 1
    <a5c>   DW_AT_decl_line   : 2
    <a5d>   DW_AT_decl_column : 22
    <a5e>   DW_AT_type        : <0xa68>
 <1><a62>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a63>   DW_AT_byte_size   : 4
    <a64>   DW_AT_type        : <0xa6d>
 <1><a68>: Abbrev Number: 6 (DW_TAG_const_type)
    <a69>   DW_AT_type        : <0xa62>
 <1><a6d>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <a6e>   DW_AT_prototyped  : 1
 <1><a6e>: Abbrev Number: 8 (DW_TAG_variable)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x50b9f): _sidata
    <a73>   DW_AT_decl_file   : 1
    <a74>   DW_AT_decl_line   : 6
    <a75>   DW_AT_decl_column : 22
    <a76>   DW_AT_type        : <0xa33>
    <a7a>   DW_AT_external    : 1
    <a7a>   DW_AT_declaration : 1
 <1><a7a>: Abbrev Number: 8 (DW_TAG_variable)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x50c2a): _sdata
    <a7f>   DW_AT_decl_file   : 1
    <a80>   DW_AT_decl_line   : 7
    <a81>   DW_AT_decl_column : 22
    <a82>   DW_AT_type        : <0xa33>
    <a86>   DW_AT_external    : 1
    <a86>   DW_AT_declaration : 1
 <1><a86>: Abbrev Number: 8 (DW_TAG_variable)
    <a87>   DW_AT_name        : (indirect string, offset: 0x50be4): _edata
    <a8b>   DW_AT_decl_file   : 1
    <a8c>   DW_AT_decl_line   : 8
    <a8d>   DW_AT_decl_column : 22
    <a8e>   DW_AT_type        : <0xa33>
    <a92>   DW_AT_external    : 1
    <a92>   DW_AT_declaration : 1
 <1><a92>: Abbrev Number: 8 (DW_TAG_variable)
    <a93>   DW_AT_name        : (indirect string, offset: 0x50c24): _sbss
    <a97>   DW_AT_decl_file   : 1
    <a98>   DW_AT_decl_line   : 9
    <a99>   DW_AT_decl_column : 22
    <a9a>   DW_AT_type        : <0xa33>
    <a9e>   DW_AT_external    : 1
    <a9e>   DW_AT_declaration : 1
 <1><a9e>: Abbrev Number: 8 (DW_TAG_variable)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x50c13): _ebss
    <aa3>   DW_AT_decl_file   : 1
    <aa4>   DW_AT_decl_line   : 10
    <aa5>   DW_AT_decl_column : 22
    <aa6>   DW_AT_type        : <0xa33>
    <aaa>   DW_AT_external    : 1
    <aaa>   DW_AT_declaration : 1
 <1><aaa>: Abbrev Number: 8 (DW_TAG_variable)
    <aab>   DW_AT_name        : (indirect string, offset: 0x50c19): _eusrstack
    <aaf>   DW_AT_decl_file   : 1
    <ab0>   DW_AT_decl_line   : 15
    <ab1>   DW_AT_decl_column : 23
    <ab2>   DW_AT_type        : <0xa33>
    <ab6>   DW_AT_external    : 1
    <ab6>   DW_AT_declaration : 1
 <1><ab6>: Abbrev Number: 9 (DW_TAG_array_type)
    <ab7>   DW_AT_type        : <0xa68>
    <abb>   DW_AT_sibling     : <0xac6>
 <2><abf>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ac0>   DW_AT_type        : <0xa4f>
    <ac4>   DW_AT_upper_bound : 88
 <2><ac5>: Abbrev Number: 0
 <1><ac6>: Abbrev Number: 6 (DW_TAG_const_type)
    <ac7>   DW_AT_type        : <0xab6>
 <1><acb>: Abbrev Number: 11 (DW_TAG_variable)
    <acc>   DW_AT_name        : (indirect string, offset: 0x50bd7): g_pfnVectors
    <ad0>   DW_AT_decl_file   : 1
    <ad1>   DW_AT_decl_line   : 156
    <ad2>   DW_AT_decl_column : 15
    <ad3>   DW_AT_type        : <0xac6>
    <ad7>   DW_AT_external    : 1
    <ad7>   DW_AT_location    : 5 byte block: 3 0 0 0 8 	(DW_OP_addr: 8000000)
 <1><add>: Abbrev Number: 12 (DW_TAG_subprogram)
    <ade>   DW_AT_external    : 1
    <ade>   DW_AT_name        : (indirect string, offset: 0x50ba7): Default_Handler
    <ae2>   DW_AT_decl_file   : 1
    <ae3>   DW_AT_decl_line   : 330
    <ae5>   DW_AT_decl_column : 6
    <ae6>   DW_AT_prototyped  : 1
    <ae6>   DW_AT_low_pc      : 0x0
    <aea>   DW_AT_high_pc     : 0x6
    <aee>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <af0>   DW_AT_GNU_all_call_sites: 1
 <1><af0>: Abbrev Number: 13 (DW_TAG_subprogram)
    <af1>   DW_AT_external    : 1
    <af1>   DW_AT_name        : (indirect string, offset: 0x50bb7): Reset_Handler
    <af5>   DW_AT_decl_file   : 1
    <af6>   DW_AT_decl_line   : 254
    <af7>   DW_AT_decl_column : 6
    <af8>   DW_AT_prototyped  : 1
    <af8>   DW_AT_low_pc      : 0x8000874
    <afc>   DW_AT_high_pc     : 0x20
    <b00>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b02>   DW_AT_GNU_all_tail_call_sites: 1
 <1><b02>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b03>   DW_AT_external    : 1
    <b03>   DW_AT_name        : (indirect string, offset: 0x50beb): __Init_Data
    <b07>   DW_AT_decl_file   : 1
    <b08>   DW_AT_decl_line   : 241
    <b09>   DW_AT_decl_column : 6
    <b0a>   DW_AT_prototyped  : 1
    <b0a>   DW_AT_low_pc      : 0x800080c
    <b0e>   DW_AT_high_pc     : 0x68
    <b12>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b14>   DW_AT_GNU_all_call_sites: 1
    <b14>   DW_AT_sibling     : <0xb37>
 <2><b18>: Abbrev Number: 15 (DW_TAG_variable)
    <b19>   DW_AT_name        : src
    <b1d>   DW_AT_decl_file   : 1
    <b1e>   DW_AT_decl_line   : 242
    <b1f>   DW_AT_decl_column : 16
    <b20>   DW_AT_type        : <0xb37>
    <b24>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b27>: Abbrev Number: 15 (DW_TAG_variable)
    <b28>   DW_AT_name        : dst
    <b2c>   DW_AT_decl_file   : 1
    <b2d>   DW_AT_decl_line   : 242
    <b2e>   DW_AT_decl_column : 22
    <b2f>   DW_AT_type        : <0xb37>
    <b33>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b36>: Abbrev Number: 0
 <1><b37>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <b38>   DW_AT_byte_size   : 4
    <b39>   DW_AT_type        : <0xa33>
 <1><b3d>: Abbrev Number: 0
  Compilation Unit @ offset 0xb3e:
   Length:        0xab5 (32-bit)
   Version:       4
   Abbrev Offset: 0x278
   Pointer Size:  4
 <0><b49>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <b4a>   DW_AT_producer    : (indirect string, offset: 0xc71a): GNU C99 10.2.0 -mcpu=cortex-m3 -mthumb -mfloat-abi=soft -march=armv7-m -g3 -O0 -std=c99 -fdata-sections -ffunction-sections -fno-exceptions
    <b4e>   DW_AT_language    : 12	(ANSI C99)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x50d34): interrupts.c
    <b53>   DW_AT_comp_dir    : (indirect string, offset: 0x4413b): /home/leha/work/Electronics/HPS_growbox/BrygðiOS/Brig-iOS
    <b57>   DW_AT_ranges      : 0x38
    <b5b>   DW_AT_low_pc      : 0x0
    <b5f>   DW_AT_stmt_list   : 0xd8f
    <b63>   DW_AT_GNU_macros  : 0xd0df
 <1><b67>: Abbrev Number: 2 (DW_TAG_base_type)
    <b68>   DW_AT_byte_size   : 1
    <b69>   DW_AT_encoding    : 6	(signed char)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x3cfec): signed char
 <1><b6e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x486c): __uint8_t
    <b73>   DW_AT_decl_file   : 3
    <b74>   DW_AT_decl_line   : 43
    <b75>   DW_AT_decl_column : 24
    <b76>   DW_AT_type        : <0xb7a>
 <1><b7a>: Abbrev Number: 2 (DW_TAG_base_type)
    <b7b>   DW_AT_byte_size   : 1
    <b7c>   DW_AT_encoding    : 8	(unsigned char)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x3ae56): unsigned char
 <1><b81>: Abbrev Number: 2 (DW_TAG_base_type)
    <b82>   DW_AT_byte_size   : 2
    <b83>   DW_AT_encoding    : 5	(signed)
    <b84>   DW_AT_name        : (indirect string, offset: 0x2da2): short int
 <1><b88>: Abbrev Number: 3 (DW_TAG_typedef)
    <b89>   DW_AT_name        : (indirect string, offset: 0x4186e): __uint16_t
    <b8d>   DW_AT_decl_file   : 3
    <b8e>   DW_AT_decl_line   : 57
    <b8f>   DW_AT_decl_column : 25
    <b90>   DW_AT_type        : <0xb94>
 <1><b94>: Abbrev Number: 2 (DW_TAG_base_type)
    <b95>   DW_AT_byte_size   : 2
    <b96>   DW_AT_encoding    : 7	(unsigned)
    <b97>   DW_AT_name        : (indirect string, offset: 0x292ee): short unsigned int
 <1><b9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x50ee4): __int32_t
    <ba0>   DW_AT_decl_file   : 3
    <ba1>   DW_AT_decl_line   : 77
    <ba2>   DW_AT_decl_column : 24
    <ba3>   DW_AT_type        : <0xba7>
 <1><ba7>: Abbrev Number: 2 (DW_TAG_base_type)
    <ba8>   DW_AT_byte_size   : 4
    <ba9>   DW_AT_encoding    : 5	(signed)
    <baa>   DW_AT_name        : (indirect string, offset: 0xfa95): long int
 <1><bae>: Abbrev Number: 3 (DW_TAG_typedef)
    <baf>   DW_AT_name        : (indirect string, offset: 0x239db): __uint32_t
    <bb3>   DW_AT_decl_file   : 3
    <bb4>   DW_AT_decl_line   : 79
    <bb5>   DW_AT_decl_column : 25
    <bb6>   DW_AT_type        : <0xbba>
 <1><bba>: Abbrev Number: 2 (DW_TAG_base_type)
    <bbb>   DW_AT_byte_size   : 4
    <bbc>   DW_AT_encoding    : 7	(unsigned)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x3067d): long unsigned int
 <1><bc1>: Abbrev Number: 2 (DW_TAG_base_type)
    <bc2>   DW_AT_byte_size   : 8
    <bc3>   DW_AT_encoding    : 5	(signed)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x2037c): long long int
 <1><bc8>: Abbrev Number: 2 (DW_TAG_base_type)
    <bc9>   DW_AT_byte_size   : 8
    <bca>   DW_AT_encoding    : 7	(unsigned)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x2be12): long long unsigned int
 <1><bcf>: Abbrev Number: 4 (DW_TAG_base_type)
    <bd0>   DW_AT_byte_size   : 4
    <bd1>   DW_AT_encoding    : 5	(signed)
    <bd2>   DW_AT_name        : int
 <1><bd6>: Abbrev Number: 2 (DW_TAG_base_type)
    <bd7>   DW_AT_byte_size   : 4
    <bd8>   DW_AT_encoding    : 7	(unsigned)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x2c338): unsigned int
 <1><bdd>: Abbrev Number: 3 (DW_TAG_typedef)
    <bde>   DW_AT_name        : (indirect string, offset: 0x486e): uint8_t
    <be2>   DW_AT_decl_file   : 4
    <be3>   DW_AT_decl_line   : 24
    <be4>   DW_AT_decl_column : 19
    <be5>   DW_AT_type        : <0xb6e>
 <1><be9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bea>   DW_AT_name        : (indirect string, offset: 0x41870): uint16_t
    <bee>   DW_AT_decl_file   : 4
    <bef>   DW_AT_decl_line   : 36
    <bf0>   DW_AT_decl_column : 20
    <bf1>   DW_AT_type        : <0xb88>
 <1><bf5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bf6>   DW_AT_type        : <0xbe9>
 <1><bfa>: Abbrev Number: 3 (DW_TAG_typedef)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x50ee6): int32_t
    <bff>   DW_AT_decl_file   : 4
    <c00>   DW_AT_decl_line   : 44
    <c01>   DW_AT_decl_column : 19
    <c02>   DW_AT_type        : <0xb9b>
 <1><c06>: Abbrev Number: 3 (DW_TAG_typedef)
    <c07>   DW_AT_name        : (indirect string, offset: 0x239dd): uint32_t
    <c0b>   DW_AT_decl_file   : 4
    <c0c>   DW_AT_decl_line   : 48
    <c0d>   DW_AT_decl_column : 20
    <c0e>   DW_AT_type        : <0xbae>
 <1><c12>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c13>   DW_AT_type        : <0xc06>
 <1><c17>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c18>   DW_AT_byte_size   : 80
    <c19>   DW_AT_decl_file   : 5
    <c1a>   DW_AT_decl_line   : 542
    <c1c>   DW_AT_decl_column : 9
    <c1d>   DW_AT_sibling     : <0xd38>
 <2><c21>: Abbrev Number: 7 (DW_TAG_member)
    <c22>   DW_AT_name        : SR
    <c25>   DW_AT_decl_file   : 5
    <c26>   DW_AT_decl_line   : 544
    <c28>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0xc12>
    <c2d>   DW_AT_data_member_location: 0
 <2><c2e>: Abbrev Number: 7 (DW_TAG_member)
    <c2f>   DW_AT_name        : CR1
    <c33>   DW_AT_decl_file   : 5
    <c34>   DW_AT_decl_line   : 545
    <c36>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0xc12>
    <c3b>   DW_AT_data_member_location: 4
 <2><c3c>: Abbrev Number: 7 (DW_TAG_member)
    <c3d>   DW_AT_name        : CR2
    <c41>   DW_AT_decl_file   : 5
    <c42>   DW_AT_decl_line   : 546
    <c44>   DW_AT_decl_column : 17
    <c45>   DW_AT_type        : <0xc12>
    <c49>   DW_AT_data_member_location: 8
 <2><c4a>: Abbrev Number: 8 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x50d73): SMPR1
    <c4f>   DW_AT_decl_file   : 5
    <c50>   DW_AT_decl_line   : 547
    <c52>   DW_AT_decl_column : 17
    <c53>   DW_AT_type        : <0xc12>
    <c57>   DW_AT_data_member_location: 12
 <2><c58>: Abbrev Number: 8 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0x50d79): SMPR2
    <c5d>   DW_AT_decl_file   : 5
    <c5e>   DW_AT_decl_line   : 548
    <c60>   DW_AT_decl_column : 17
    <c61>   DW_AT_type        : <0xc12>
    <c65>   DW_AT_data_member_location: 16
 <2><c66>: Abbrev Number: 8 (DW_TAG_member)
    <c67>   DW_AT_name        : (indirect string, offset: 0x510a6): JOFR1
    <c6b>   DW_AT_decl_file   : 5
    <c6c>   DW_AT_decl_line   : 549
    <c6e>   DW_AT_decl_column : 17
    <c6f>   DW_AT_type        : <0xc12>
    <c73>   DW_AT_data_member_location: 20
 <2><c74>: Abbrev Number: 8 (DW_TAG_member)
    <c75>   DW_AT_name        : (indirect string, offset: 0x510ac): JOFR2
    <c79>   DW_AT_decl_file   : 5
    <c7a>   DW_AT_decl_line   : 550
    <c7c>   DW_AT_decl_column : 17
    <c7d>   DW_AT_type        : <0xc12>
    <c81>   DW_AT_data_member_location: 24
 <2><c82>: Abbrev Number: 8 (DW_TAG_member)
    <c83>   DW_AT_name        : (indirect string, offset: 0x510b2): JOFR3
    <c87>   DW_AT_decl_file   : 5
    <c88>   DW_AT_decl_line   : 551
    <c8a>   DW_AT_decl_column : 17
    <c8b>   DW_AT_type        : <0xc12>
    <c8f>   DW_AT_data_member_location: 28
 <2><c90>: Abbrev Number: 8 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0x5108b): JOFR4
    <c95>   DW_AT_decl_file   : 5
    <c96>   DW_AT_decl_line   : 552
    <c98>   DW_AT_decl_column : 17
    <c99>   DW_AT_type        : <0xc12>
    <c9d>   DW_AT_data_member_location: 32
 <2><c9e>: Abbrev Number: 7 (DW_TAG_member)
    <c9f>   DW_AT_name        : HTR
    <ca3>   DW_AT_decl_file   : 5
    <ca4>   DW_AT_decl_line   : 553
    <ca6>   DW_AT_decl_column : 17
    <ca7>   DW_AT_type        : <0xc12>
    <cab>   DW_AT_data_member_location: 36
 <2><cac>: Abbrev Number: 7 (DW_TAG_member)
    <cad>   DW_AT_name        : LTR
    <cb1>   DW_AT_decl_file   : 5
    <cb2>   DW_AT_decl_line   : 554
    <cb4>   DW_AT_decl_column : 17
    <cb5>   DW_AT_type        : <0xc12>
    <cb9>   DW_AT_data_member_location: 40
 <2><cba>: Abbrev Number: 8 (DW_TAG_member)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x50d6e): SQR1
    <cbf>   DW_AT_decl_file   : 5
    <cc0>   DW_AT_decl_line   : 555
    <cc2>   DW_AT_decl_column : 17
    <cc3>   DW_AT_type        : <0xc12>
    <cc7>   DW_AT_data_member_location: 44
 <2><cc8>: Abbrev Number: 8 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x50eee): SQR2
    <ccd>   DW_AT_decl_file   : 5
    <cce>   DW_AT_decl_line   : 556
    <cd0>   DW_AT_decl_column : 17
    <cd1>   DW_AT_type        : <0xc12>
    <cd5>   DW_AT_data_member_location: 48
 <2><cd6>: Abbrev Number: 8 (DW_TAG_member)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x51008): SQR3
    <cdb>   DW_AT_decl_file   : 5
    <cdc>   DW_AT_decl_line   : 557
    <cde>   DW_AT_decl_column : 17
    <cdf>   DW_AT_type        : <0xc12>
    <ce3>   DW_AT_data_member_location: 52
 <2><ce4>: Abbrev Number: 8 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x50f60): JSQR
    <ce9>   DW_AT_decl_file   : 5
    <cea>   DW_AT_decl_line   : 558
    <cec>   DW_AT_decl_column : 17
    <ced>   DW_AT_type        : <0xc12>
    <cf1>   DW_AT_data_member_location: 56
 <2><cf2>: Abbrev Number: 8 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x50e80): JDR1
    <cf7>   DW_AT_decl_file   : 5
    <cf8>   DW_AT_decl_line   : 559
    <cfa>   DW_AT_decl_column : 17
    <cfb>   DW_AT_type        : <0xc12>
    <cff>   DW_AT_data_member_location: 60
 <2><d00>: Abbrev Number: 8 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0x50e85): JDR2
    <d05>   DW_AT_decl_file   : 5
    <d06>   DW_AT_decl_line   : 560
    <d08>   DW_AT_decl_column : 17
    <d09>   DW_AT_type        : <0xc12>
    <d0d>   DW_AT_data_member_location: 64
 <2><d0e>: Abbrev Number: 8 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x50e8a): JDR3
    <d13>   DW_AT_decl_file   : 5
    <d14>   DW_AT_decl_line   : 561
    <d16>   DW_AT_decl_column : 17
    <d17>   DW_AT_type        : <0xc12>
    <d1b>   DW_AT_data_member_location: 68
 <2><d1c>: Abbrev Number: 8 (DW_TAG_member)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x510a1): JDR4
    <d21>   DW_AT_decl_file   : 5
    <d22>   DW_AT_decl_line   : 562
    <d24>   DW_AT_decl_column : 17
    <d25>   DW_AT_type        : <0xc12>
    <d29>   DW_AT_data_member_location: 72
 <2><d2a>: Abbrev Number: 7 (DW_TAG_member)
    <d2b>   DW_AT_name        : DR
    <d2e>   DW_AT_decl_file   : 5
    <d2f>   DW_AT_decl_line   : 563
    <d31>   DW_AT_decl_column : 17
    <d32>   DW_AT_type        : <0xc12>
    <d36>   DW_AT_data_member_location: 76
 <2><d37>: Abbrev Number: 0
 <1><d38>: Abbrev Number: 9 (DW_TAG_typedef)
    <d39>   DW_AT_name        : (indirect string, offset: 0x50e6e): ADC_TypeDef
    <d3d>   DW_AT_decl_file   : 5
    <d3e>   DW_AT_decl_line   : 564
    <d40>   DW_AT_decl_column : 3
    <d41>   DW_AT_type        : <0xc17>
 <1><d45>: Abbrev Number: 6 (DW_TAG_structure_type)
    <d46>   DW_AT_byte_size   : 24
    <d47>   DW_AT_decl_file   : 5
    <d48>   DW_AT_decl_line   : 887
    <d4a>   DW_AT_decl_column : 9
    <d4b>   DW_AT_sibling     : <0xda3>
 <2><d4f>: Abbrev Number: 7 (DW_TAG_member)
    <d50>   DW_AT_name        : IMR
    <d54>   DW_AT_decl_file   : 5
    <d55>   DW_AT_decl_line   : 889
    <d57>   DW_AT_decl_column : 17
    <d58>   DW_AT_type        : <0xc12>
    <d5c>   DW_AT_data_member_location: 0
 <2><d5d>: Abbrev Number: 7 (DW_TAG_member)
    <d5e>   DW_AT_name        : EMR
    <d62>   DW_AT_decl_file   : 5
    <d63>   DW_AT_decl_line   : 890
    <d65>   DW_AT_decl_column : 17
    <d66>   DW_AT_type        : <0xc12>
    <d6a>   DW_AT_data_member_location: 4
 <2><d6b>: Abbrev Number: 8 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x3d679): RTSR
    <d70>   DW_AT_decl_file   : 5
    <d71>   DW_AT_decl_line   : 891
    <d73>   DW_AT_decl_column : 17
    <d74>   DW_AT_type        : <0xc12>
    <d78>   DW_AT_data_member_location: 8
 <2><d79>: Abbrev Number: 8 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0xb6f8): FTSR
    <d7e>   DW_AT_decl_file   : 5
    <d7f>   DW_AT_decl_line   : 892
    <d81>   DW_AT_decl_column : 17
    <d82>   DW_AT_type        : <0xc12>
    <d86>   DW_AT_data_member_location: 12
 <2><d87>: Abbrev Number: 8 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0x38435): SWIER
    <d8c>   DW_AT_decl_file   : 5
    <d8d>   DW_AT_decl_line   : 893
    <d8f>   DW_AT_decl_column : 17
    <d90>   DW_AT_type        : <0xc12>
    <d94>   DW_AT_data_member_location: 16
 <2><d95>: Abbrev Number: 7 (DW_TAG_member)
    <d96>   DW_AT_name        : PR
    <d99>   DW_AT_decl_file   : 5
    <d9a>   DW_AT_decl_line   : 894
    <d9c>   DW_AT_decl_column : 17
    <d9d>   DW_AT_type        : <0xc12>
    <da1>   DW_AT_data_member_location: 20
 <2><da2>: Abbrev Number: 0
 <1><da3>: Abbrev Number: 9 (DW_TAG_typedef)
    <da4>   DW_AT_name        : (indirect string, offset: 0x128c9): EXTI_TypeDef
    <da8>   DW_AT_decl_file   : 5
    <da9>   DW_AT_decl_line   : 895
    <dab>   DW_AT_decl_column : 3
    <dac>   DW_AT_type        : <0xd45>
 <1><db0>: Abbrev Number: 6 (DW_TAG_structure_type)
    <db1>   DW_AT_byte_size   : 40
    <db2>   DW_AT_decl_file   : 5
    <db3>   DW_AT_decl_line   : 1104
    <db5>   DW_AT_decl_column : 9
    <db6>   DW_AT_sibling     : <0xed3>
 <2><dba>: Abbrev Number: 7 (DW_TAG_member)
    <dbb>   DW_AT_name        : CRH
    <dbf>   DW_AT_decl_file   : 5
    <dc0>   DW_AT_decl_line   : 1106
    <dc2>   DW_AT_decl_column : 17
    <dc3>   DW_AT_type        : <0xbf5>
    <dc7>   DW_AT_data_member_location: 0
 <2><dc8>: Abbrev Number: 8 (DW_TAG_member)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x344fd): RESERVED0
    <dcd>   DW_AT_decl_file   : 5
    <dce>   DW_AT_decl_line   : 1107
    <dd0>   DW_AT_decl_column : 13
    <dd1>   DW_AT_type        : <0xbe9>
    <dd5>   DW_AT_data_member_location: 2
 <2><dd6>: Abbrev Number: 7 (DW_TAG_member)
    <dd7>   DW_AT_name        : CRL
    <ddb>   DW_AT_decl_file   : 5
    <ddc>   DW_AT_decl_line   : 1108
    <dde>   DW_AT_decl_column : 17
    <ddf>   DW_AT_type        : <0xbf5>
    <de3>   DW_AT_data_member_location: 4
 <2><de4>: Abbrev Number: 8 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0x34507): RESERVED1
    <de9>   DW_AT_decl_file   : 5
    <dea>   DW_AT_decl_line   : 1109
    <dec>   DW_AT_decl_column : 13
    <ded>   DW_AT_type        : <0xbe9>
    <df1>   DW_AT_data_member_location: 6
 <2><df2>: Abbrev Number: 8 (DW_TAG_member)
    <df3>   DW_AT_name        : (indirect string, offset: 0x45a2d): PRLH
    <df7>   DW_AT_decl_file   : 5
    <df8>   DW_AT_decl_line   : 1110
    <dfa>   DW_AT_decl_column : 17
    <dfb>   DW_AT_type        : <0xbf5>
    <dff>   DW_AT_data_member_location: 8
 <2><e00>: Abbrev Number: 8 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x34511): RESERVED2
    <e05>   DW_AT_decl_file   : 5
    <e06>   DW_AT_decl_line   : 1111
    <e08>   DW_AT_decl_column : 13
    <e09>   DW_AT_type        : <0xbe9>
    <e0d>   DW_AT_data_member_location: 10
 <2><e0e>: Abbrev Number: 8 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x25794): PRLL
    <e13>   DW_AT_decl_file   : 5
    <e14>   DW_AT_decl_line   : 1112
    <e16>   DW_AT_decl_column : 17
    <e17>   DW_AT_type        : <0xbf5>
    <e1b>   DW_AT_data_member_location: 12
 <2><e1c>: Abbrev Number: 8 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x3451b): RESERVED3
    <e21>   DW_AT_decl_file   : 5
    <e22>   DW_AT_decl_line   : 1113
    <e24>   DW_AT_decl_column : 13
    <e25>   DW_AT_type        : <0xbe9>
    <e29>   DW_AT_data_member_location: 14
 <2><e2a>: Abbrev Number: 8 (DW_TAG_member)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x39a3d): DIVH
    <e2f>   DW_AT_decl_file   : 5
    <e30>   DW_AT_decl_line   : 1114
    <e32>   DW_AT_decl_column : 17
    <e33>   DW_AT_type        : <0xbf5>
    <e37>   DW_AT_data_member_location: 16
 <2><e38>: Abbrev Number: 8 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0x34525): RESERVED4
    <e3d>   DW_AT_decl_file   : 5
    <e3e>   DW_AT_decl_line   : 1115
    <e40>   DW_AT_decl_column : 13
    <e41>   DW_AT_type        : <0xbe9>
    <e45>   DW_AT_data_member_location: 18
 <2><e46>: Abbrev Number: 8 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0x39a61): DIVL
    <e4b>   DW_AT_decl_file   : 5
    <e4c>   DW_AT_decl_line   : 1116
    <e4e>   DW_AT_decl_column : 17
    <e4f>   DW_AT_type        : <0xbf5>
    <e53>   DW_AT_data_member_location: 20
 <2><e54>: Abbrev Number: 8 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x3452f): RESERVED5
    <e59>   DW_AT_decl_file   : 5
    <e5a>   DW_AT_decl_line   : 1117
    <e5c>   DW_AT_decl_column : 13
    <e5d>   DW_AT_type        : <0xbe9>
    <e61>   DW_AT_data_member_location: 22
 <2><e62>: Abbrev Number: 8 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0x39bb9): CNTH
    <e67>   DW_AT_decl_file   : 5
    <e68>   DW_AT_decl_line   : 1118
    <e6a>   DW_AT_decl_column : 17
    <e6b>   DW_AT_type        : <0xbf5>
    <e6f>   DW_AT_data_member_location: 24
 <2><e70>: Abbrev Number: 8 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0x9057): RESERVED6
    <e75>   DW_AT_decl_file   : 5
    <e76>   DW_AT_decl_line   : 1119
    <e78>   DW_AT_decl_column : 13
    <e79>   DW_AT_type        : <0xbe9>
    <e7d>   DW_AT_data_member_location: 26
 <2><e7e>: Abbrev Number: 8 (DW_TAG_member)
    <e7f>   DW_AT_name        : (indirect string, offset: 0x1b04c): CNTL
    <e83>   DW_AT_decl_file   : 5
    <e84>   DW_AT_decl_line   : 1120
    <e86>   DW_AT_decl_column : 17
    <e87>   DW_AT_type        : <0xbf5>
    <e8b>   DW_AT_data_member_location: 28
 <2><e8c>: Abbrev Number: 8 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x3455d): RESERVED7
    <e91>   DW_AT_decl_file   : 5
    <e92>   DW_AT_decl_line   : 1121
    <e94>   DW_AT_decl_column : 13
    <e95>   DW_AT_type        : <0xbe9>
    <e99>   DW_AT_data_member_location: 30
 <2><e9a>: Abbrev Number: 8 (DW_TAG_member)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x23463): ALRH
    <e9f>   DW_AT_decl_file   : 5
    <ea0>   DW_AT_decl_line   : 1122
    <ea2>   DW_AT_decl_column : 17
    <ea3>   DW_AT_type        : <0xbf5>
    <ea7>   DW_AT_data_member_location: 32
 <2><ea8>: Abbrev Number: 8 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x34567): RESERVED8
    <ead>   DW_AT_decl_file   : 5
    <eae>   DW_AT_decl_line   : 1123
    <eb0>   DW_AT_decl_column : 13
    <eb1>   DW_AT_type        : <0xbe9>
    <eb5>   DW_AT_data_member_location: 34
 <2><eb6>: Abbrev Number: 8 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x234ba): ALRL
    <ebb>   DW_AT_decl_file   : 5
    <ebc>   DW_AT_decl_line   : 1124
    <ebe>   DW_AT_decl_column : 17
    <ebf>   DW_AT_type        : <0xbf5>
    <ec3>   DW_AT_data_member_location: 36
 <2><ec4>: Abbrev Number: 8 (DW_TAG_member)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x34571): RESERVED9
    <ec9>   DW_AT_decl_file   : 5
    <eca>   DW_AT_decl_line   : 1125
    <ecc>   DW_AT_decl_column : 13
    <ecd>   DW_AT_type        : <0xbe9>
    <ed1>   DW_AT_data_member_location: 38
 <2><ed2>: Abbrev Number: 0
 <1><ed3>: Abbrev Number: 9 (DW_TAG_typedef)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x2c911): RTC_TypeDef
    <ed8>   DW_AT_decl_file   : 5
    <ed9>   DW_AT_decl_line   : 1126
    <edb>   DW_AT_decl_column : 3
    <edc>   DW_AT_type        : <0xdb0>
 <1><ee0>: Abbrev Number: 6 (DW_TAG_structure_type)
    <ee1>   DW_AT_byte_size   : 80
    <ee2>   DW_AT_decl_file   : 5
    <ee3>   DW_AT_decl_line   : 1186
    <ee5>   DW_AT_decl_column : 9
    <ee6>   DW_AT_sibling     : <0x111a>
 <2><eea>: Abbrev Number: 7 (DW_TAG_member)
    <eeb>   DW_AT_name        : CR1
    <eef>   DW_AT_decl_file   : 5
    <ef0>   DW_AT_decl_line   : 1188
    <ef2>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0xbf5>
    <ef7>   DW_AT_data_member_location: 0
 <2><ef8>: Abbrev Number: 8 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x344fd): RESERVED0
    <efd>   DW_AT_decl_file   : 5
    <efe>   DW_AT_decl_line   : 1189
    <f00>   DW_AT_decl_column : 13
    <f01>   DW_AT_type        : <0xbe9>
    <f05>   DW_AT_data_member_location: 2
 <2><f06>: Abbrev Number: 7 (DW_TAG_member)
    <f07>   DW_AT_name        : CR2
    <f0b>   DW_AT_decl_file   : 5
    <f0c>   DW_AT_decl_line   : 1190
    <f0e>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xbf5>
    <f13>   DW_AT_data_member_location: 4
 <2><f14>: Abbrev Number: 8 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0x34507): RESERVED1
    <f19>   DW_AT_decl_file   : 5
    <f1a>   DW_AT_decl_line   : 1191
    <f1c>   DW_AT_decl_column : 13
    <f1d>   DW_AT_type        : <0xbe9>
    <f21>   DW_AT_data_member_location: 6
 <2><f22>: Abbrev Number: 8 (DW_TAG_member)
    <f23>   DW_AT_name        : (indirect string, offset: 0xaebf): SMCR
    <f27>   DW_AT_decl_file   : 5
    <f28>   DW_AT_decl_line   : 1192
    <f2a>   DW_AT_decl_column : 17
    <f2b>   DW_AT_type        : <0xbf5>
    <f2f>   DW_AT_data_member_location: 8
 <2><f30>: Abbrev Number: 8 (DW_TAG_member)
    <f31>   DW_AT_name        : (indirect string, offset: 0x34511): RESERVED2
    <f35>   DW_AT_decl_file   : 5
    <f36>   DW_AT_decl_line   : 1193
    <f38>   DW_AT_decl_column : 13
    <f39>   DW_AT_type        : <0xbe9>
    <f3d>   DW_AT_data_member_location: 10
 <2><f3e>: Abbrev Number: 8 (DW_TAG_member)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x347c9): DIER
    <f43>   DW_AT_decl_file   : 5
    <f44>   DW_AT_decl_line   : 1194
    <f46>   DW_AT_decl_column : 17
    <f47>   DW_AT_type        : <0xbf5>
    <f4b>   DW_AT_data_member_location: 12
 <2><f4c>: Abbrev Number: 8 (DW_TAG_member)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x3451b): RESERVED3
    <f51>   DW_AT_decl_file   : 5
    <f52>   DW_AT_decl_line   : 1195
    <f54>   DW_AT_decl_column : 13
    <f55>   DW_AT_type        : <0xbe9>
    <f59>   DW_AT_data_member_location: 14
 <2><f5a>: Abbrev Number: 7 (DW_TAG_member)
    <f5b>   DW_AT_name        : SR
    <f5e>   DW_AT_decl_file   : 5
    <f5f>   DW_AT_decl_line   : 1196
    <f61>   DW_AT_decl_column : 17
    <f62>   DW_AT_type        : <0xbf5>
    <f66>   DW_AT_data_member_location: 16
 <2><f67>: Abbrev Number: 8 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0x34525): RESERVED4
    <f6c>   DW_AT_decl_file   : 5
    <f6d>   DW_AT_decl_line   : 1197
    <f6f>   DW_AT_decl_column : 13
    <f70>   DW_AT_type        : <0xbe9>
    <f74>   DW_AT_data_member_location: 18
 <2><f75>: Abbrev Number: 7 (DW_TAG_member)
    <f76>   DW_AT_name        : EGR
    <f7a>   DW_AT_decl_file   : 5
    <f7b>   DW_AT_decl_line   : 1198
    <f7d>   DW_AT_decl_column : 17
    <f7e>   DW_AT_type        : <0xbf5>
    <f82>   DW_AT_data_member_location: 20
 <2><f83>: Abbrev Number: 8 (DW_TAG_member)
    <f84>   DW_AT_name        : (indirect string, offset: 0x3452f): RESERVED5
    <f88>   DW_AT_decl_file   : 5
    <f89>   DW_AT_decl_line   : 1199
    <f8b>   DW_AT_decl_column : 13
    <f8c>   DW_AT_type        : <0xbe9>
    <f90>   DW_AT_data_member_location: 22
 <2><f91>: Abbrev Number: 8 (DW_TAG_member)
    <f92>   DW_AT_name        : (indirect string, offset: 0x23325): CCMR1
    <f96>   DW_AT_decl_file   : 5
    <f97>   DW_AT_decl_line   : 1200
    <f99>   DW_AT_decl_column : 17
    <f9a>   DW_AT_type        : <0xbf5>
    <f9e>   DW_AT_data_member_location: 24
 <2><f9f>: Abbrev Number: 8 (DW_TAG_member)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x9057): RESERVED6
    <fa4>   DW_AT_decl_file   : 5
    <fa5>   DW_AT_decl_line   : 1201
    <fa7>   DW_AT_decl_column : 13
    <fa8>   DW_AT_type        : <0xbe9>
    <fac>   DW_AT_data_member_location: 26
 <2><fad>: Abbrev Number: 8 (DW_TAG_member)
    <fae>   DW_AT_name        : (indirect string, offset: 0x2332b): CCMR2
    <fb2>   DW_AT_decl_file   : 5
    <fb3>   DW_AT_decl_line   : 1202
    <fb5>   DW_AT_decl_column : 17
    <fb6>   DW_AT_type        : <0xbf5>
    <fba>   DW_AT_data_member_location: 28
 <2><fbb>: Abbrev Number: 8 (DW_TAG_member)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x3455d): RESERVED7
    <fc0>   DW_AT_decl_file   : 5
    <fc1>   DW_AT_decl_line   : 1203
    <fc3>   DW_AT_decl_column : 13
    <fc4>   DW_AT_type        : <0xbe9>
    <fc8>   DW_AT_data_member_location: 30
 <2><fc9>: Abbrev Number: 8 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0x34399): CCER
    <fce>   DW_AT_decl_file   : 5
    <fcf>   DW_AT_decl_line   : 1204
    <fd1>   DW_AT_decl_column : 17
    <fd2>   DW_AT_type        : <0xbf5>
    <fd6>   DW_AT_data_member_location: 32
 <2><fd7>: Abbrev Number: 8 (DW_TAG_member)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x34567): RESERVED8
    <fdc>   DW_AT_decl_file   : 5
    <fdd>   DW_AT_decl_line   : 1205
    <fdf>   DW_AT_decl_column : 13
    <fe0>   DW_AT_type        : <0xbe9>
    <fe4>   DW_AT_data_member_location: 34
 <2><fe5>: Abbrev Number: 7 (DW_TAG_member)
    <fe6>   DW_AT_name        : CNT
    <fea>   DW_AT_decl_file   : 5
    <feb>   DW_AT_decl_line   : 1206
    <fed>   DW_AT_decl_column : 17
    <fee>   DW_AT_type        : <0xbf5>
    <ff2>   DW_AT_data_member_location: 36
 <2><ff3>: Abbrev Number: 8 (DW_TAG_member)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x34571): RESERVED9
    <ff8>   DW_AT_decl_file   : 5
    <ff9>   DW_AT_decl_line   : 1207
    <ffb>   DW_AT_decl_column : 13
    <ffc>   DW_AT_type        : <0xbe9>
    <1000>   DW_AT_data_member_location: 38
 <2><1001>: Abbrev Number: 7 (DW_TAG_member)
    <1002>   DW_AT_name        : PSC
    <1006>   DW_AT_decl_file   : 5
    <1007>   DW_AT_decl_line   : 1208
    <1009>   DW_AT_decl_column : 17
    <100a>   DW_AT_type        : <0xbf5>
    <100e>   DW_AT_data_member_location: 40
 <2><100f>: Abbrev Number: 8 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0x2396d): RESERVED10
    <1014>   DW_AT_decl_file   : 5
    <1015>   DW_AT_decl_line   : 1209
    <1017>   DW_AT_decl_column : 13
    <1018>   DW_AT_type        : <0xbe9>
    <101c>   DW_AT_data_member_location: 42
 <2><101d>: Abbrev Number: 7 (DW_TAG_member)
    <101e>   DW_AT_name        : ARR
    <1022>   DW_AT_decl_file   : 5
    <1023>   DW_AT_decl_line   : 1210
    <1025>   DW_AT_decl_column : 17
    <1026>   DW_AT_type        : <0xbf5>
    <102a>   DW_AT_data_member_location: 44
 <2><102b>: Abbrev Number: 8 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0x23978): RESERVED11
    <1030>   DW_AT_decl_file   : 5
    <1031>   DW_AT_decl_line   : 1211
    <1033>   DW_AT_decl_column : 13
    <1034>   DW_AT_type        : <0xbe9>
    <1038>   DW_AT_data_member_location: 46
 <2><1039>: Abbrev Number: 7 (DW_TAG_member)
    <103a>   DW_AT_name        : RCR
    <103e>   DW_AT_decl_file   : 5
    <103f>   DW_AT_decl_line   : 1212
    <1041>   DW_AT_decl_column : 17
    <1042>   DW_AT_type        : <0xbf5>
    <1046>   DW_AT_data_member_location: 48
 <2><1047>: Abbrev Number: 8 (DW_TAG_member)
    <1048>   DW_AT_name        : (indirect string, offset: 0x23983): RESERVED12
    <104c>   DW_AT_decl_file   : 5
    <104d>   DW_AT_decl_line   : 1213
    <104f>   DW_AT_decl_column : 13
    <1050>   DW_AT_type        : <0xbe9>
    <1054>   DW_AT_data_member_location: 50
 <2><1055>: Abbrev Number: 8 (DW_TAG_member)
    <1056>   DW_AT_name        : (indirect string, offset: 0x380b4): CCR1
    <105a>   DW_AT_decl_file   : 5
    <105b>   DW_AT_decl_line   : 1214
    <105d>   DW_AT_decl_column : 17
    <105e>   DW_AT_type        : <0xbf5>
    <1062>   DW_AT_data_member_location: 52
 <2><1063>: Abbrev Number: 8 (DW_TAG_member)
    <1064>   DW_AT_name        : (indirect string, offset: 0x2398e): RESERVED13
    <1068>   DW_AT_decl_file   : 5
    <1069>   DW_AT_decl_line   : 1215
    <106b>   DW_AT_decl_column : 13
    <106c>   DW_AT_type        : <0xbe9>
    <1070>   DW_AT_data_member_location: 54
 <2><1071>: Abbrev Number: 8 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0x173c4): CCR2
    <1076>   DW_AT_decl_file   : 5
    <1077>   DW_AT_decl_line   : 1216
    <1079>   DW_AT_decl_column : 17
    <107a>   DW_AT_type        : <0xbf5>
    <107e>   DW_AT_data_member_location: 56
 <2><107f>: Abbrev Number: 8 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0x23999): RESERVED14
    <1084>   DW_AT_decl_file   : 5
    <1085>   DW_AT_decl_line   : 1217
    <1087>   DW_AT_decl_column : 13
    <1088>   DW_AT_type        : <0xbe9>
    <108c>   DW_AT_data_member_location: 58
 <2><108d>: Abbrev Number: 8 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x380de): CCR3
    <1092>   DW_AT_decl_file   : 5
    <1093>   DW_AT_decl_line   : 1218
    <1095>   DW_AT_decl_column : 17
    <1096>   DW_AT_type        : <0xbf5>
    <109a>   DW_AT_data_member_location: 60
 <2><109b>: Abbrev Number: 8 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0x239a4): RESERVED15
    <10a0>   DW_AT_decl_file   : 5
    <10a1>   DW_AT_decl_line   : 1219
    <10a3>   DW_AT_decl_column : 13
    <10a4>   DW_AT_type        : <0xbe9>
    <10a8>   DW_AT_data_member_location: 62
 <2><10a9>: Abbrev Number: 8 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x380e3): CCR4
    <10ae>   DW_AT_decl_file   : 5
    <10af>   DW_AT_decl_line   : 1220
    <10b1>   DW_AT_decl_column : 17
    <10b2>   DW_AT_type        : <0xbf5>
    <10b6>   DW_AT_data_member_location: 64
 <2><10b7>: Abbrev Number: 8 (DW_TAG_member)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x239af): RESERVED16
    <10bc>   DW_AT_decl_file   : 5
    <10bd>   DW_AT_decl_line   : 1221
    <10bf>   DW_AT_decl_column : 13
    <10c0>   DW_AT_type        : <0xbe9>
    <10c4>   DW_AT_data_member_location: 66
 <2><10c5>: Abbrev Number: 8 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0xacc4): BDTR
    <10ca>   DW_AT_decl_file   : 5
    <10cb>   DW_AT_decl_line   : 1222
    <10cd>   DW_AT_decl_column : 17
    <10ce>   DW_AT_type        : <0xbf5>
    <10d2>   DW_AT_data_member_location: 68
 <2><10d3>: Abbrev Number: 8 (DW_TAG_member)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x239ba): RESERVED17
    <10d8>   DW_AT_decl_file   : 5
    <10d9>   DW_AT_decl_line   : 1223
    <10db>   DW_AT_decl_column : 13
    <10dc>   DW_AT_type        : <0xbe9>
    <10e0>   DW_AT_data_member_location: 70
 <2><10e1>: Abbrev Number: 7 (DW_TAG_member)
    <10e2>   DW_AT_name        : DCR
    <10e6>   DW_AT_decl_file   : 5
    <10e7>   DW_AT_decl_line   : 1224
    <10e9>   DW_AT_decl_column : 17
    <10ea>   DW_AT_type        : <0xbf5>
    <10ee>   DW_AT_data_member_location: 72
 <2><10ef>: Abbrev Number: 8 (DW_TAG_member)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x239c5): RESERVED18
    <10f4>   DW_AT_decl_file   : 5
    <10f5>   DW_AT_decl_line   : 1225
    <10f7>   DW_AT_decl_column : 13
    <10f8>   DW_AT_type        : <0xbe9>
    <10fc>   DW_AT_data_member_location: 74
 <2><10fd>: Abbrev Number: 8 (DW_TAG_member)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x1d269): DMAR
    <1102>   DW_AT_decl_file   : 5
    <1103>   DW_AT_decl_line   : 1226
    <1105>   DW_AT_decl_column : 17
    <1106>   DW_AT_type        : <0xbf5>
    <110a>   DW_AT_data_member_location: 76
 <2><110b>: Abbrev Number: 8 (DW_TAG_member)
    <110c>   DW_AT_name        : (indirect string, offset: 0x239d0): RESERVED19
    <1110>   DW_AT_decl_file   : 5
    <1111>   DW_AT_decl_line   : 1227
    <1113>   DW_AT_decl_column : 13
    <1114>   DW_AT_type        : <0xbe9>
    <1118>   DW_AT_data_member_location: 78
 <2><1119>: Abbrev Number: 0
 <1><111a>: Abbrev Number: 9 (DW_TAG_typedef)
    <111b>   DW_AT_name        : (indirect string, offset: 0x2c7b9): TIM_TypeDef
    <111f>   DW_AT_decl_file   : 5
    <1120>   DW_AT_decl_line   : 1228
    <1122>   DW_AT_decl_column : 3
    <1123>   DW_AT_type        : <0xee0>
 <1><1127>: Abbrev Number: 2 (DW_TAG_base_type)
    <1128>   DW_AT_byte_size   : 1
    <1129>   DW_AT_encoding    : 8	(unsigned char)
    <112a>   DW_AT_name        : (indirect string, offset: 0x3cff3): char
 <1><112e>: Abbrev Number: 10 (DW_TAG_variable)
    <112f>   DW_AT_name        : (indirect string, offset: 0x402a0): temperature
    <1133>   DW_AT_decl_file   : 6
    <1134>   DW_AT_decl_line   : 17
    <1135>   DW_AT_decl_column : 17
    <1136>   DW_AT_type        : <0xc06>
    <113a>   DW_AT_external    : 1
    <113a>   DW_AT_declaration : 1
 <1><113a>: Abbrev Number: 10 (DW_TAG_variable)
    <113b>   DW_AT_name        : (indirect string, offset: 0x8303): flags
    <113f>   DW_AT_decl_file   : 6
    <1140>   DW_AT_decl_line   : 18
    <1141>   DW_AT_decl_column : 17
    <1142>   DW_AT_type        : <0xc06>
    <1146>   DW_AT_external    : 1
    <1146>   DW_AT_declaration : 1
 <1><1146>: Abbrev Number: 10 (DW_TAG_variable)
    <1147>   DW_AT_name        : (indirect string, offset: 0x50d98): calls
    <114b>   DW_AT_decl_file   : 7
    <114c>   DW_AT_decl_line   : 25
    <114d>   DW_AT_decl_column : 17
    <114e>   DW_AT_type        : <0xc06>
    <1152>   DW_AT_external    : 1
    <1152>   DW_AT_declaration : 1
 <1><1152>: Abbrev Number: 11 (DW_TAG_subprogram)
    <1153>   DW_AT_external    : 1
    <1153>   DW_AT_name        : (indirect string, offset: 0x50d7f): DMA2_Channel5_IRQHandler
    <1157>   DW_AT_decl_file   : 2
    <1158>   DW_AT_decl_line   : 283
    <115a>   DW_AT_decl_column : 6
    <115b>   DW_AT_prototyped  : 1
    <115b>   DW_AT_low_pc      : 0x8000b0a
    <115f>   DW_AT_high_pc     : 0x6
    <1163>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1165>   DW_AT_GNU_all_call_sites: 1
 <1><1165>: Abbrev Number: 11 (DW_TAG_subprogram)
    <1166>   DW_AT_external    : 1
    <1166>   DW_AT_name        : (indirect string, offset: 0x50c64): DMA2_Channel4_5_IRQHandler
    <116a>   DW_AT_decl_file   : 2
    <116b>   DW_AT_decl_line   : 279
    <116d>   DW_AT_decl_column : 6
    <116e>   DW_AT_prototyped  : 1
    <116e>   DW_AT_low_pc      : 0x8000b04
